[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
0
1
2
3
4
5
6
7
8
9
##5
##8
##6
##0
##9
##1
##7
##2
##3
##4
12
29
16
10
19
11
23
13
24
14
28
45
43
22
15
25
39
17
##17
27
48
32
20
52
47
53
33
30
46
26
##47
42
35
161
59
37
126
62
18
72
21
243
66
34
106
80
31
50
44
##18
76
##82
36
283
67
282
##06
55
140
370
57
317
459
127
247
169
41
276
##41
79
217
##03
56
202
49
83
133
##19
300
69
102
134
##88
426
77
230
54
##81
431
##89
##53
##83
##11
536
##59
253
447
##12
70
168
122
##13
226
522
176
##52
##35
##87
142
##34
533
432
##84
92
227
##42
159
##85
251
453
153
##15
87
130
173
267
##45
##49
358
272
629
##64
##80
##95
##10
146
462
##57
##09
107
82
347
##40
200
##99
147
101
##62
163
##04
##54
421
334
212
##61
132
##50
524
##02
525
335
246
##43
##56
128
177
##16
360
##44
##07
592
647
433
##01
##48
##55
117
485
58
229
93
112
254
116
##46
263
232
180
73
478
574
##51
304
192
162
##58
344
97
##90
518
##00
##97
##92
312
113
275
725
172
##93
68
##67
157
248
114
882
137
##69
213
118
451
##14
782
249
444
##65
1006
##94
##98
307
90
123
##66
470
481
457
115
422
837
1017
193
355
120
108
40
379
415
416
342
456
65
277
158
##32
##96
74
222
472
800
##38
252
541
348
455
##31
187
903
718
##86
223
##68
63
##91
208
296
941
215
454
135
220
152
##05
565
698
546
228
1188
785
336
606
285
313
392
773
279
##30
75
314
394
794
781
121
552
618
595
813
350
264
922
332
354
266
##75
366
634
406
##60
1195
553
1475
89
124
##08
448
##37
467
442
917
776
136
345
221
1124
329
757
353
935
390
1642
532
297
583
274
471
189
86
535
511
521
311
812
1299
804
818
548
771
540
1596
330
819
242
1012
255
302
787
1203
141
499
1652
435
476
434
762
71
331
309
1259
382
1053
571
##72
338
594
119
464
##63
191
##70
1002
579
1661
322
519
299
971
615
##36
1003
665
831
##39
398
635
##79
918
396
308
##76
175
260
361
657
380
333
131
1277
2319
495
561
295
1499
1592
209
262
439
250
461
691
389
915
1227
224
94
241
734
692
494
1644
550
1584
643
591
403
1555
328
##78
938
2162
473
240
145
678
477
1178
964
352
854
1182
138
1359
965
424
641
956
1004
365
575
292
440
623
1319
711
337
280
933
612
538
1192
988
64
981
998
1430
1051
##74
233
671
1024
705
99
##71
806
##77
182
646
889
1068
1338
1021
505
1110
1352
373
1864
236
98
652
1645
1290
60
783
1162
1325
753
853
578
1032
662
##73
1104
878
341
739
690
1426
1042
989
1593
190
542
290
852
1640
689
1100
836
706
3034
1759
611
884
761
1236
683
1038
675
1101
829
1130
940
239
1263
626
862
707
861
875
1377
539
830
1133
1365
810
2643
850
2169
291
1347
599
669
1495
395
790
196
1698
719
949
1958
95
315
526
1249
1174
682
1619
1326
105
270
466
887
1512
91
423
413
588
507
1425
156
1097
920
81
1209
2538
1570
749
984
1364
1132
178
990
1329
405
468
1153
1226
1680
1424
2641
864
##24
1311
2124
100
1582
319
1310
38
895
1847
1522
265
1635
437
359
1275
##33
1107
736
517
601
357
909
1397
566
1135
1575
684
784
1059
916
642
914
1574
237
144
1239
1286
653
148
1667
799
2260
1129
166
744
1013
474
603
788
849
397
590
1223
593
1600
760
881
679
1121
197
374
947
1536
381
493
602
1403
1027
2213
2006
980
921
609
1087
1274
613
817
919
310
500
1287
1089
367
741
877
1193
808
1405
823
1085
1935
2175
491
693
1228
1207
1675
109
672
149
261
945
625
723
402
969
573
1370
483
955
1245
225
1648
1141
1496
1903
1794
51
959
1160
1525
979
1048
826
96
1758
409
1213
1116
2415
155
372
1440
369
798
2483
281
722
2037
1322
2420
1493
1431
1803
2436
1154
1446
1732
880
349
356
1050
1928
710
1610
885
1361
458
1389
972
904
2089
417
2113
674
640
2418
1556
661
1553
502
856
2583
1168
1453
2636
2879
1438
534
598
1899
824
888
754
2059
708
1282
1497
767
859
1094
1366
1491
822
732
512
2283
78
1506
568
1125
2170
1770
2732
1268
103
186
2351
2421
649
482
506
1622
1934
412
772
942
288
1545
1478
1786
531
1001
1041
110
231
1092
966
393
961
411
515
174
371
1769
1080
811
1534
1057
475
503
650
1022
1706
2208
1822
899
729
547
384
1450
1588
1206
2909
1581
1324
2290
1134
1479
1235
438
1894
2008
383
1649
873
1881
327
832
1461
745
1394
1760
1476
907
1009
1170
2041
1868
##20
235
777
2210
2066
2197
1985
1568
2250
301
589
61
1354
1272
3284
2434
104
3444
1415
1618
1842
2409
181
1811
2187
408
407
648
1233
644
962
967
1993
554
586
1139
1231
840
1470
632
991
2448
1819
170
1832
214
2023
449
1401
928
1353
1666
1383
3917
179
1804
809
986
1603
1105
1723
1106
1763
726
687
2334
513
3173
770
2235
1500
3381
1877
85
3289
897
1918
1190
139
323
1307
580
1672
906
2460
497
194
655
1643
1267
508
559
2229
520
216
3452
614
1445
1787
2042
1378
2363
523
164
479
1883
2764
1345
1517
1332
750
963
1411
1854
1801
610
1145
1564
2069
428
562
388
2198
1701
446
792
1780
1331
600
1276
2172
645
866
1793
205
999
1219
1662
1164
872
1870
1211
1295
2612
1252
2575
2746
378
651
1448
2820
740
1047
1948
1990
2000
1507
1653
2349
2038
1300
219
2047
1158
2572
486
443
567
867
1551
2046
1812
2945
1180
1109
3882
1058
154
1789
3331
385
1650
1988
1562
3478
608
855
1183
620
3171
1693
791
759
1198
218
704
925
1632
1323
2328
2214
636
659
185
1016
1210
624
3931
1654
1613
2116
560
584
1242
1045
1184
1396
2601
673
386
2487
1798
4108
968
2309
1421
3026
387
1795
1756
2471
1636
842
1660
2403
2595
977
617
1019
1388
2111
702
937
418
1251
2885
2667
1075
129
1201
1011
1316
1025
1576
1088
286
1583
795
779
587
84
2992
1943
1063
582
758
844
465
2056
2109
1208
958
1509
376
1466
427
926
752
2570
2022
1376
851
463
3138
1123
883
2280
1518
1559
3544
4942
1724
516
1907
1731
143
2706
3087
2681
2181
2828
1381
2080
1072
821
1243
1294
2306
2401
2816
2807
3950
3361
3092
3096
622
1467
1363
954
1015
1382
1745
3702
923
680
1514
3093
2611
664
3105
1572
2918
1035
2600
1817
3492
709
1527
400
848
1368
2590
2039
2604
551
2122
3024
4079
616
160
1367
3750
188
1685
2346
1391
203
4262
2536
4622
1651
1671
2765
1816
2535
3828
3856
1008
326
3270
2067
2655
2114
1577
510
1248
1055
2454
2731
1834
2029
838
828
2126
715
1456
3271
211
975
1878
681
2464
2704
805
2470
2125
1163
2779
751
1283
1037
1362
2065
2098
269
2613
1872
890
993
2354
2580
724
318
1422
939
452
441
953
1913
150
2707
543
1302
2679
630
1144
4635
2687
1205
2527
1647
1007
2317
287
436
429
3804
703
3016
1414
1788
2119
1728
1147
484
340
3151
825
973
167
2316
2682
2102
1699
2269
1688
1656
1919
1967
2860
2799
2776
2996
111
1747
2152
802
766
3329
985
1567
1696
871
1526
1054
2375
2407
1412
324
4681
2616
3639
1465
1682
1387
1684
1328
1774
3919
1061
619
1665
2813
3308
1615
1851
1839
3617
1222
2921
1200
2347
3669
1473
2463
5168
2017
670
847
1646
1488
151
886
4141
3479
1585
1501
2327
1920
4727
857
948
1605
1119
2075
2692
2177
1333
3474
1128
3954
1705
3013
2191
1710
1857
717
1159
2061
3714
803
3620
1597
1186
3829
607
165
1142
2882
2680
1802
1278
4091
1031
1995
3402
1687
1626
1829
685
2949
1906
489
4682
2835
1911
1996
1189
2073
3043
469
727
362
1462
514
1464
171
5070
3604
676
2121
995
1256
2343
2693
1858
2178
545
1739
3470
4224
3224
2988
1049
1046
1905
1398
5307
2117
2769
492
789
1954
2288
2281
3738
3175
125
1443
1416
1504
3315
2115
2148
3667
738
1194
2540
2077
3748
1264
1212
1093
2397
4369
2209
2573
3062
3543
3797
363
1729
4160
1181
2718
527
3074
4092
892
1293
2987
1718
278
2011
528
4252
4207
2027
2308
1805
404
2906
1452
1543
4894
5249
5066
3641
572
2176
735
2912
1034
1117
256
3248
3611
4324
1874
2513
2585
1702
3215
2030
420
183
2320
3123
712
2984
1676
1040
1185
2358
3918
2658
3581
3724
1336
4337
841
1036
1306
2789
5257
3041
2615
3116
2272
2773
4000
960
2957
2449
2289
2785
3143
879
4015
5158
913
934
2408
2864
2504
3276
2082
2060
2074
4781
4230
2142
3498
2629
893
1052
1417
1547
480
4891
3316
3747
6269
2105
2833
5553
1472
633
1202
2940
2369
2501
425
1014
1637
1321
4226
1103
2392
1358
1503
204
2156
2192
569
1624
4019
6461
581
816
952
1369
2405
271
2795
5912
5980
3141
5624
876
1520
5145
585
944
1280
1972
1118
2806
2819
450
2560
3168
4468
4596
2005
5194
6002
742
1240
1617
1664
1902
3964
3253
797
1762
5325
6100
1292
1187
2357
2361
273
487
3359
3368
1260
501
544
5439
3343
2630
1929
1625
1379
1835
3494
1400
1730
931
1528
3898
748
1998
1150
1317
2850
320
2045
5354
3502
1897
8092
6755
1023
4325
3920
4068
7106
2461
2866
1515
1560
2019
1833
728
2101
2190
3701
4136
2534
1463
3814
4175
747
1095
234
1709
2745
3250
339
3340
3375
1304
1120
2775
3220
1056
1979
2488
2411
1566
2598
1748
4749
460
4691
2656
1814
3162
3679
1320
2291
2230
2979
2626
2333
5105
780
786
992
1540
1548
4299
2472
4169
775
4858
730
1136
2973
88
1609
1914
1146
2400
2282
3514
5967
2830
5531
796
1342
3871
1657
1386
2241
3970
488
5312
1853
2107
4195
2727
846
1284
1157
2444
2845
1712
1785
3277
2034
2064
537
3055
2647
4206
3559
577
1468
2292
4728
3536
5138
1084
199
1976
2356
2878
4558
1716
4803
2053
3387
3056
5227
970
4163
3421
3360
3525
1970
1484
2040
3015
3158
4455
5496
1532
2676
1523
5198
3883
845
1915
1197
1796
2610
2651
596
2437
4454
3614
4149
2532
1224
2728
1177
4097
4172
756
843
911
1083
2502
3993
2688
2150
558
833
1686
929
1927
3803
6591
996
298
1999
1974
2332
1792
2740
206
2010
530
2686
3761
3778
3135
509
4405
3708
1697
4159
4026
5808
896
1244
2865
2244
1741
1719
4834
321
3757
2146
1402
1694
4964
4261
1594
3351
4338
1137
2424
5171
3860
1281
2969
1658
1949
1940
1904
2805
4355
1563
2596
1711
4814
3378
351
1852
1060
3610
419
1776
3608
1173
930
3815
3885
746
2991
2204
2646
2165
6656
3186
5084
2839
3709
4154
2129
4229
4012
3322
2427
604
902
1289
1043
1196
1395
1513
1542
2743
207
3458
4119
7984
2173
1337
5178
957
1978
2550
3978
2076
1818
3100
4485
3653
3612
4595
2533
1166
3027
1350
2810
1704
4883
5293
3390
3094
667
4409
3675
2763
2305
1764
2670
5255
1773
976
3129
3139
3526
6124
656
997
1946
1314
2511
1746
2090
5264
2475
2530
2631
2130
3927
4031
8494
5103
713
1296
1602
2414
1487
2555
2013
3376
3083
4641
4652
5986
2164
3417
3649
6788
5653
1330
3722
293
1149
1516
2567
1715
3204
4704
4634
3588
3760
2193
5665
835
1309
5922
2138
4420
7577
2622
1655
1945
1115
1315
1459
1442
2295
1549
1546
2757
2690
3515
3465
4416
5787
4986
1346
5406
2261
1079
686
1372
1230
2627
3891
4025
1247
2994
2315
4580
2561
2796
5238
5300
1884
5757
4113
2002
6853
3925
755
1018
2355
2876
1791
5344
3032
3755
3766
6237
4440
4148
2304
1800
1931
3221
2989
1669
1909
1102
2842
4557
399
3285
529
4697
1266
1831
2144
3450
3154
1221
1579
2625
4046
983
2856
4517
201
2609
4201
621
1885
1895
3431
4456
5669
2531
2515
3070
4223
1932
2774
6306
2978
5479
860
910
1257
1298
2995
2954
2930
2447
1434
1498
2869
4317
2232
3960
1790
4710
5396
3052
4642
3659
3652
3655
3176
6936
2297
4011
3363
2974
6030
3830
7451
4183
2417
2255
2246
2505
3370
4249
3782
3407
8040
6749
4106
1533
1305
2007
4089
2429
3835
5137
2374
1449
2818
1544
258
2574
3902
3936
5311
3318
3086
2694
4288
4258
5910
3775
1265
184
1880
1844
3446
3193
2826
1407
1220
1469
1074
1138
898
2952
2950
2938
2399
1392
2419
1455
2216
2542
4818
3247
2099
3385
1862
3183
3159
2831
1126
1573
4227
6468
716
1152
2872
4374
1510
2568
2753
4743
3037
4600
4666
2158
3112
5097
5775
5652
4958
2301
5401
5330
2546
3127
2423
3025
5628
1099
1091
2402
1437
3983
3916
5275
4648
3589
3577
1887
1890
7215
6647
4593
410
4110
2174
7043
7077
1460
737
1722
1374
4056
2221
2224
6442
3625
1148
1318
1355
3296
5200
5397
306
3535
1262
1815
2145
2143
2160
807
5054
2768
1530
1077
1175
2323
2496
3897
6418
7538
6855
982
912
1111
2336
1490
2841
2202
2581
2557
5285
4790
4791
3790
6604
3451
7931
4474
4327
1623
3896
7898
7558
943
198
1987
2366
2484
2092
5253
4610
2642
3504
5906
5965
3743
3410
5095
3661
3676
2838
2478
414
5600
1537
2724
6473
1808
1373
1933
1871
3923
4672
3726
401
2947
2904
1683
2412
1413
1451
2870
4552
4565
3957
3909
1750
2700
2736
3217
4640
4636
2695
3776
2108
6638
3499
2179
4909
8313
3009
1474
7330
1923
6926
5472
688
869
1384
1385
1399
1393
1447
2801
2800
2234
1535
1580
2556
2578
3982
3943
3969
1781
1734
2051
3342
4219
1612
5974
2135
3149
4494
3672
2824
3705
1270
4931
1335
7752
4471
2725
1070
8224
3071
3327
4677
6122
3806
2998
1981
1962
2455
1454
2855
3995
3905
3242
3365
4618
3593
3131
4464
5588
5772
2476
4111
4979
6955
7768
5498
4478
8277
6474
1720
7445
1521
3827
5197
7193
6825
5144
3723
6177
7521
743
1216
294
1960
2390
1492
4503
2299
2256
1713
4831
3241
2009
4746
3330
4282
3578
5995
6261
1840
3657
3678
5707
5456
4326
1169
3075
4080
2777
3922
6017
9478
4122
894
1246
1081
1039
1944
1969
1994
2497
2873
4501
4868
2085
2031
4665
4231
3505
3576
5948
3783
3767
2185
2155
6633
5036
4124
4963
4933
5467
7081
1229
2128
1628
6069
8605
6412
6434
5125
6140
8671
8672
4929
654
2937
1959
1357
1390
1489
4518
3211
5203
4766
5346
5991
377
1809
7237
6642
3481
316
3166
7603
5555
4146
4977
839
699
4314
1225
2675
2678
905
1237
4570
3663
5324
863
4033
6823
3817
5119
6073
1678
1966
2338
2490
2240
2508
3082
2691
4289
3574
5961
3716
1810
721
2188
2153
3406
4437
6735
5718
4137
5684
4981
4910
5459
5430
4475
4331
9303
3079
6519
6384
3924
7495
6033
5629
1253
1297
1681
1951
1968
1112
2492
2854
2597
3940
2715
2710
3200
5232
5334
3045
4613
4657
2617
2662
4203
3741
1888
1850
1843
1837
3461
3170
4162
498
3002
2307
5431
4537
1629
9790
6866
4088
6370
8137
5142
3838
6160
1098
1199
2735
2018
2091
5395
3332
4630
3765
2432
3405
5059
3662
5516
5748
4145
5620
4902
5403
4216
1172
4726
2521
6364
4678
6129
6824
8153
5875
5878
1113
1482
1483
2788
2786
4824
3218
3280
3292
3272
4759
4731
3362
4645
4643
3503
1269
5071
7679
6798
6763
5502
5776
5655
5488
9268
8292
1633
2467
1122
4062
3729
7129
1250
1689
1010
1406
2843
2247
1505
2591
3945
4806
4860
2003
2055
5267
5382
5384
3088
3099
4204
3512
5949
5053
5038
4413
677
5566
2477
1692
4144
4983
1349
5441
8717
6292
1638
1176
3122
8903
8197
2928
9934
5132
7173
8928
815
1634
1953
1901
1156
1114
289
2804
2808
4567
2549
2594
3949
3961
2798
2739
4893
4836
3264
3210
3257
2079
5231
5268
3014
3036
3545
5908
627
1856
2163
6615
3430
3433
5013
4482
5785
4107
7991
4930
7762
7760
2267
1766
1232
5830
6574
3523
1825
5473
6162
5625
6597
4523
950
2908
2364
2394
2458
2868
4391
2548
3988
3267
3232
2084
2054
2044
4758
5393
3313
4656
3562
597
1867
210
2433
4451
5540
4936
694
6967
778
7799
5452
5221
1420
5333
1301
2720
7388
3078
9053
1879
6411
8118
6722
5147
10579
6142
8484
8436
946
195
2342
2896
2217
2589
3976
2791
4804
2071
5306
5313
4295
4236
3590
3739
2106
3693
3637
6767
5702
4164
7986
7975
563
5642
5694
4973
5361
3600
932
9785
5184
1086
4002
2770
6362
6377
7739
8131
4061
7574
3022
6155
6627
4027
5129
6496
3834
8321
4188
7527
7035
7569
901
1000
1984
1900
2396
1380
4342
2587
3972
4879
2093
5295
5250
3350
3044
3031
4241
5988
7202
8085
3192
5034
5067
4452
6710
2825
1271
6909
5490
4536
1531
2298
2329
7317
1925
2139
4052
7553
5526
6156
3893
3520
6482
8145
3816
7100
8114
5471
3886
3872
8425
6801
6196
1241
1288
2936
1910
1971
1312
2452
1485
1480
1589
1552
1753
4815
3243
3251
3231
5283
5254
5237
4711
4735
4787
3306
3397
3367
3033
2606
3531
5964
5958
3753
3735
2104
3463
3117
3161
3146
5030
5037
5567
5596
5738
4103
4152
4992
6949
10212
7748
927
1737
8200
5251
6475
4332
9352
5188
7519
9228
8906
5323
2976
8181
4773
3524
6843
6405
7841
6192
5850
7468
900
1217
1234
2944
1952
1950
2446
284
2849
430
1541
1557
3966
5259
5252
5299
3089
2640
3519
3466
4490
4460
7682
7681
7604
7667
2832
2834
5547
3177
4101
5672
7749
7761
7086
1595
2120
5183
4003
6343
5537
6151
6007
3819
3866
6021
9619
3728
7325
7320
5120
5475
7038
7177
6544
858
1659
1916
1143
2377
1313
1419
4524
2258
2547
2541
1797
2787
3209
4794
3302
4602
4660
2650
2669
4287
4237
5940
5900
3740
6289
6248
1849
7246
2134
3484
3469
3437
5069
5014
7660
3603
3643
5577
5708
2760
6969
7702
5445
9211
1738
2721
1775
1926
1726
4050
4007
4568
2227
3928
6184
4421
5832
3825
2929
7113
7114
3377
7833
7194
5884
10966
4024
9695
4825
5155
5891
6446
5627
6454
11118
7805
8456
2999
2946
1668
1082
2371
1418
4382
4380
4302
1587
1783
2741
2744
4881
3206
3290
3268
5294
4748
4278
3552
3564
6203
7298
8098
5058
5093
7605
3613
3665
6708
555
5505
5573
1408
5705
5679
4994
6947
6902
6956
7759
7007
1427
8216
2633
7369
1921
1721
2491
4220
6547
7858
5527
4673
3820
6158
9989
6620
8875
4823
8400
5135
8561
8486
7354
6563
868
1215
2985
2961
2901
1607
1980
2489
2859
2886
4534
4510
4546
2238
2507
2558
1749
1707
2747
4867
3299
5245
3312
3364
3059
2618
2657
2608
4279
4271
16134
5984
3706
3713
3736
1898
7211
2157
2166
663
6600
6636
3403
1062
3119
3164
3199
4419
4444
4496
768
6736
5712
2473
4117
4109
5648
5614
5639
8360
10211
5442
5494
1428
9273
8246
8233
5243
2469
5847
9307
7394
1939
4085
7484
2524
8138
3533
2422
7118
3229
2628
3522
6625
10004
6846
6024
6094
8227
7721
6598
7033
4044
1218
2966
1090
1161
2451
4507
3994
3991
1757
2792
2738
4849
4801
4890
4800
4896
3219
5207
5265
4706
4785
4762
5389
3345
3366
3336
4644
4208
5944
5914
3718
3737
6242
6271
7267
7278
7274
2103
2140
6667
3485
3118
3188
4408
7657
7631
3686
2821
5513
1404
4919
4907
4901
1344
5417
5923
5853
1165
2632
9796
11370
9050
4053
2771
2223
1876
6363
7856
7583
8952
8688
2920
1820
9106
6423
10133
6022
6132
4099
5890
6141
6144
6109
6456
8677
7593
4528
10997
987
951
1963
1140
2380
2330
2462
1410
1432
2892
1511
2599
2577
3937
1752
1742
4895
4832
2014
2072
5270
3010
3050
2649
3541
3510
3572
5901
5976
3786
6245
1893
7240
6686
8013
3182
5083
5016
5007
5033
4458
7639
6706
6756
6776
2827
557
5762
7974
5695
4984
4937
3007
1343
4264
2539
5225
4329
4323
2722
4625
8259
2465
5928
5924
9314
7381
7337
9769
3126
7826
7827
10067
6311
6316
1529
10125
6570
6571
6921
4037
3529
3373
6435
10587
3859
7413
4020
9721
4170
5476
3844
12068
4070
4074
7500
7470
1254
1258
2953
2916
1606
1989
1341
1441
1435
2848
4586
4359
4345
4356
2284
2251
1519
1502
1565
2582
3962
3930
4859
4880
4886
2062
4764
4795
4793
5345
3304
3372
3019
4659
4661
4247
3565
3560
5962
5904
5966
5931
5968
1261
7264
2167
6660
3434
3467
3104
5081
368
3648
5713
5744
564
5667
4987
4915
8312
6953
6950
4313
5222
8710
6298
6472
5865
9787
1131
7825
8372
4168
3427
2222
5415
5833
8657
5193
6438
2923
3374
9904
1827
1824
6003
6019
6623
6821
5883
11325
10056
5179
6848
7842
6133
4028
4098
7102
5124
7867
11349
7454
9673
8510
6005
10477
6166
7150
8476
6079
10492
4922
1204
1641
1044
2384
1457
4350
2287
257
3989
1782
4888
4889
3235
2083
2036
5272
4768
3338
4647
2664
5930
6270
1859
1869
720
7299
2149
6652
3441
3432
764
6741
6765
6739
5799
5770
4104
4156
2171
4914
4968
8394
7715
2300
4476
4472
7042
1767
4321
2279
1590
4628
10706
8244
3475
2296
2639
9767
6818
1375
2498
4058
3422
6564
6504
2778
2525
5413
6304
6185
2663
4671
4763
7625
3826
7345
6081
6013
6040
8525
9564
5889
6098
10318
4121
10462
4078
8584
5809
5804
8423
8418
6169
11599
3628
7350
11174
10526
714
2981
2965
1673
1096
2389
2340
2348
1356
244
2441
2445
2495
2815
4535
4383
4376
2206
2243
3959
3946
3951
1703
1799
1754
1744
1700
2759
4884
4843
3230
3233
2087
2057
2068
5211
5279
4780
4707
4737
5341
5319
5380
3314
3081
3066
2645
2607
2665
4234
4246
3509
3501
3563
5919
5959
5971
6204
6277
1841
1813
7287
7258
7286
7205
3457
3460
10695
4489
4410
7649
7691
3682
3666
3670
6703
6796
5511
5591
5747
5788
5780
5793
4591
7930
5603
5619
5608
4911
8349
697
6916
10261
5487
700
7048
5228
8754
8796
2672
10148
5926
2321
7374
9774
8820
4560
7418
7406
2205
1524
4063
8656
3895
6929
6922
3521
9964
9961
6011
6085
6009
6016
9893
5424
8523
8848
6827
10941
5117
5149
9603
7226
7725
5477
8325
6149
6324
9990
3855
3878
7029
4187
10885
7528
10546
4928
7897
14921
11991
1608
1991
2303
2386
2372
1360
2456
2803
2889
4559
4513
4585
4520
1554
2552
2564
2543
2592
2586
3914
3908
1735
2754
3256
3237
3239
2088
2094
5296
5273
4718
4783
4761
4755
5314
3341
303
4615
4693
4667
2652
4273
3549
3599
6287
1882
1807
7250
7248
7266
7231
2189
6635
6699
6674
3181
3196
5088
4415
4445
4465
7602
3645
3656
6764
6748
6794
5550
5758
5671
2024
4989
8358
6937
7704
5481
5404
5465
5436
4473
5224
9263
2277
870
8795
6293
4620
8252
2004
1639
1779
5925
7338
4786
9745
6864
1578
4574
4059
4051
3420
1586
7435
4723
4724
2528
5416
5460
7855
7561
3321
4426
5320
3021
7871
3227
9150
9449
6467
7535
7065
6831
6832
8164
8646
10003
10085
6422
6137
10916
9664
9607
4093
5026
7328
8999
9674
6329
8509
8540
5800
3887
8729
11840
8440
10072
7030
6854
4923
7358
5856
8806
11023
7436
1255
1917
1947
1912
2365
1303
2459
2846
4307
2252
2588
2562
3971
3977
3973
1717
1743
2793
2708
4835
3259
3278
5242
4796
4770
5318
5357
3382
3357
4699
4650
5934
5942
375
3752
6241
6244
1860
2154
3419
3455
8011
8075
8077
3187
3195
3132
4418
7662
3695
6789
5545
5557
5571
4135
5640
2025
8304
6903
6911
6957
6958
6992
6971
4268
4269
7714
7798
7775
2302
5434
7004
7074
9238
15300
8790
8732
8774
2671
4624
8217
13219
1778
1179
936
11657
7306
11339
11441
13793
13773
2137
6512
2772
2520
6397
5463
7587
5528
6342
4064
8980
4670
10032
9183
6572
9443
7340
7344
6441
6459
6449
6891
9583
6820
9161
6840
7444
10878
9196
7412
4021
4023
7105
8569
10366
4829
11084
8116
9060
9994
14486
11094
7591
6594
6174
8482
7523
6221
6227
6809
15727
5101
7151
4527
7036
11594
10466
7892
14177
7479
8460
9026
8691
1285
2956
1983
2388
2311
2482
2457
2857
2862
2893
4547
4304
4360
1550
1508
3958
3998
2797
2705
4852
3254
3261
3260
2081
2012
2097
5210
5216
5230
4740
4736
5385
5356
5390
3039
4663
3547
3583
3550
3500
5936
3787
3794
3798
3773
6273
6224
1806
1892
7257
7262
7255
7271
2147
2182
2168
6648
8003
8012
8071
3153
3185
3156
5060
4447
7695
7696
3640
3699
3694
3677
6719
6753
6792
5538
14071
5717
5732
5733
4134
4143
4105
7982
7945
5662
5658
5691
5633
4940
4938
4978
8388
8381
8393
3004
6945
1029
10246
7734
5483
2537
7006
14248
5339
9285
2510
8731
8763
6291
6297
8235
8210
4214
13278
6479
11790
5806
9318
11236
2637
1620
11301
8826
7823
4221
4087
4010
4004
6580
7482
3486
637
6301
9412
6063
3929
7541
7584
9172
7579
7572
2425
3028
3228
3807
3894
9151
7116
6464
6440
6465
6052
6115
9408
9491
10549
3869
6530
6130
9199
7419
10854
5140
7225
4171
4173
5023
7322
10306
4821
4125
9427
10226
8322
6118
4072
6320
6450
6596
8420
10197
10110
10727
4005
7424
7475
7478
8463
9960
6043
7136
10186
2982
2902
1033
1155
2359
2376
1481
2881
2891
2863
4362
4368
2245
2500
3939
4861
4855
3203
3262
3258
3293
2035
5288
5260
4732
5372
5374
3317
3300
3369
3018
3080
3068
4607
4646
2603
2648
4212
4240
4243
3582
3595
3507
3532
5985
5978
3715
3780
3754
3763
6274
1889
1866
1836
6613
6684
6690
343
3416
10668
8061
5050
5074
4492
4433
763
7613
7607
3635
3690
6757
6779
5517
5563
3703
576
5703
5752
5766
12735
12769
4153
4102
4114
7958
496
4985
4961
4998
834
8380
8324
3005
6906
6952
6976
6973
7764
7776
5409
5440
5466
5368
4470
7041
7019
7000
7078
9242
8708
2677
6299
14635
14687
10751
8203
5246
1772
5882
5862
9304
9394
11297
11292
7311
7363
1922
11399
2132
4514
3076
3072
4705
8376
8374
1938
12009
6517
6549
6557
6540
7409
2220
2529
2233
6382
6341
6315
6338
6379
7554
6181
9224
3320
6349
12447
5113
8124
10029
3225
2621
9482
4039
9941
16451
6051
11625
7531
7537
10327
6116
10511
9848
6031
6135
11166
3727
7220
7108
8858
4179
5121
10382
10397
10369
10314
3846
7458
5896
9622
9672
8408
8976
5807
6455
5840
3877
8832
6222
10157
5104
10377
11474
8922
14524
8411
7868
8469
9113
6048
9574
6568
6883
8698
13574
12501
9005
2968
1604
1030
1941
1908
238
2381
2350
2410
1444
2840
2875
2877
4553
4540
4548
4341
2257
1569
2584
2569
3935
3944
1784
1714
2737
4812
3201
3269
2033
5386
3380
3339
3098
4684
4638
2698
4270
3537
5987
5993
6215
6256
6286
1845
1896
7282
7253
7295
7243
7256
2431
6681
6673
3489
3483
3404
10607
10667
10669
8083
8016
3111
3160
5082
5041
5001
5024
4438
4463
7619
3638
2823
5518
5512
5546
5532
5572
5765
12718
12783
4155
2762
7934
7970
5615
5664
4947
4956
4932
8333
6935
7767
7738
7772
7777
5449
5457
5486
5408
7089
12291
9215
9245
9278
15314
13044
14673
10752
10799
10796
10775
10739
8298
8231
1471
16389
13284
5258
6471
4336
1127
11215
7395
9799
9797
3125
11440
8824
2136
2133
7828
7822
1238
12316
4579
10867
4009
3424
6552
2226
639
13550
3136
7812
5522
8132
8902
4424
5831
8618
8609
5111
8125
12996
12033
7620
3822
3824
5192
6150
9186
3808
3809
3802
3892
6439
4038
4030
4032
4774
6413
10048
9911
9969
9859
6524
6004
6896
6110
8846
7190
8870
8142
11534
13972
7843
10596
6136
9697
8850
8889
3842
6147
6145
12722
13533
11062
8547
7925
12111
7402
5846
3876
6171
6172
5829
10158
4008
11448
8573
11198
11197
7178
7174
8929
12931
10405
5815
9523
9446
11875
10950
15668
10831
7466
10430
6569
11027
9108
9101
9104
12468
11727
9325
891
994
2951
2900
1957
1955
2382
2352
2440
1494
1486
2802
2871
4569
4319
4388
4301
4351
2285
2231
2519
2593
3941
3985
3956
3992
3974
1740
4857
4892
4878
3266
3273
2052
2015
2095
5241
5209
4745
4709
4792
5359
5387
5355
3399
3396
3067
4611
2684
2654
4257
3542
5947
5989
5951
3719
3762
3777
6253
6278
1846
1865
1863
7216
7201
7236
2141
2184
6651
6692
6696
6691
3435
3490
3493
10651
8089
8034
8042
8001
3198
3163
5047
5052
5042
5080
5090
4480
4402
7638
6783
6715
5515
5510
5590
5508
3707
5701
5700
5774
5720
4590
4166
4132
4191
7961
7901
7946
7951
5634
5661
5605
4955
8382
8316
3008
6983
6910
10242
10207
10298
10231
10279
4263
7703
7795
7796
5480
5468
7082
7059
7051
7097
12203
12256
5336
9289
9279
4533
8761
14667
10782
10716
10724
8215
8251
8232
3476
3471
1327
11732
11739
5866
9320
7307
7393
7376
9719
11381
11330
6869
6865
13747
13712
9056
11583
11549
11557
8375
10171
12053
10859
4081
4083
6541
7459
7449
6318
6381
6367
6366
6308
7588
12147
3508
8911
12482
9175
7576
7571
5322
8682
8611
8123
10127
7872
7621
10531
6356
6436
8548
9888
9981
1828
1821
7831
11629
5428
9401
8102
9541
10557
9152
8161
8648
8643
10089
6014
9169
10137
7880
8495
6099
10898
10906
10980
14985
14980
9597
9594
9685
7223
8805
8886
10385
10331
9426
11047
11010
6500
3837
6152
10449
9626
6325
6870
5133
8588
6102
12192
8428
6170
4186
4180
4189
12915
5877
8417
8461
7520
7529
7522
5166
5160
14330
12830
9535
10077
7039
8477
6072
11814
5721
7357
10408
10400
8930
5812
5857
11182
12402
8865
13421
8457
7567
7469
9971
9838
9830
7163
12629
9822
9121
9437
2964
2907
1601
1956
1997
1992
1108
2379
2416
2817
4519
4504
4566
4358
4396
2218
2215
2286
259
3906
2780
2750
2701
4813
4840
4805
3282
3213
3279
2049
5219
5235
5202
5208
5276
4799
4767
4714
4798
4739
5381
5301
5376
3395
3310
3058
4685
4675
2634
4217
4218
4259
4248
4291
3554
3516
3548
3551
3568
1611
5911
5915
5975
5937
6218
6283
7218
2183
2112
6659
6661
6614
6672
3480
10646
10639
3150
5019
5005
4467
7606
7689
3650
3602
6734
6709
6754
6797
6793
5541
5509
5569
5530
14015
570
5734
5761
5790
5798
5730
5777
4139
7911
7990
7978
5604
5678
2020
4917
4905
8317
8385
8315
8357
8344
6940
6954
6961
10254
10255
13453
7719
7754
5443
5448
7014
12254
1429
9218
9266
1598
8741
6296
1078
10730
820
8296
8270
10142
3344
12861
4339
5818
11613
11679
733
9715
9776
3121
11318
11382
6863
9049
12361
4228
4095
4054
3429
7489
5410
1873
6389
6335
6380
6365
6394
6332
6337
9419
13581
6067
7733
6188
11956
8981
8940
8969
13636
7578
2970
5838
8647
8681
8687
8121
12998
7878
7877
14118
7628
11901
9483
9452
9409
9461
6927
6437
6433
7110
9881
6462
9814
9913
9945
1826
9817
6529
6053
6087
6629
5420
8521
6112
6838
6839
8107
8508
7197
10580
9144
8159
9843
8958
11355
6845
6035
7886
6721
6727
14944
4022
9618
9653
9637
7104
9046
4178
5022
8565
7548
8592
7806
7852
10305
4129
10014
11009
11054
11086
10925
10801
6502
3845
12066
6161
6148
8503
6558
13327
6101
6107
3884
8721
3851
7590
16322
12944
10113
15187
14367
13821
13870
6190
7171
3629
12562
10936
8920
8921
11176
11177
7121
7122
10522
5810
5858
10438
10439
9102
12573
7169
11527
8696
12537
11125
8155
9469
9014
14356
10333
2997
1663
1961
2353
2345
2398
2368
2370
2373
2485
2867
4545
4555
4551
4385
4395
4397
4398
4375
2259
2249
1561
2579
3901
3965
1755
4841
4853
3283
3238
2032
5289
5291
4712
4779
5383
5340
5343
5375
3301
3047
3053
3035
3048
3046
3038
4688
4683
4662
4616
4658
4694
4605
4637
2602
4292
4286
3553
3584
3585
3555
3567
16135
5994
3785
3768
12617
12603
6259
6285
6268
1886
7234
7285
7207
7251
7293
7263
2159
2196
2186
6643
6646
6632
6671
3447
3411
3412
3468
3436
8006
8088
8080
8067
8039
3155
3167
5064
5051
5096
4417
4449
4462
7616
7601
7686
3684
2837
6781
6712
6761
6731
2822
5749
5710
5797
5769
5731
5763
3172
12717
12764
793
7924
5641
5609
5674
5677
4967
4974
8311
13342
6941
6999
6914
6933
10285
10265
13493
774
7783
5453
5499
5450
5432
701
7095
7010
7057
7090
7098
12231
12260
12276
2268
2266
2263
1761
14246
14297
4322
9256
9269
9214
2273
15311
8760
8736
1733
2673
4623
10713
10735
10742
10795
10710
10707
10152
10160
3346
2127
13251
1777
11734
11799
9319
9388
9310
11250
11296
11239
11220
11602
11692
11673
7303
7359
7301
7360
7308
1924
16231
9718
9789
9734
9710
9708
9739
5181
11369
6806
6861
11443
8828
13719
13710
9019
9087
12312
12301
11541
12088
10861
10863
3428
6511
15859
7462
8008
2522
9031
6392
9410
13587
15237
11888
11884
7857
6061
3926
12159
6180
9223
3328
3326
6340
4069
5536
8989
8935
8967
4674
9176
8659
8601
8638
5110
8187
10124
12034
14153
7627
11904
16614
3222
6157
10033
9180
6577
9158
9157
12271
12274
9434
9440
7348
6924
14510
14504
7115
9889
6488
9986
9988
9935
9995
8894
9882
6523
6088
6080
7835
7838
10329
11046
5427
5423
11008
6830
10386
8622
9554
12497
10547
10559
9153
9142
9145
10975
7499
8957
5173
5174
10599
10592
6428
14882
6039
6037
8490
3813
6138
8177
10895
12078
10983
10961
6723
5161
9595
9634
9684
9692
9669
11168
11163
8804
7101
13899
4176
8568
8888
12827
8593
7859
15067
10312
9428
10926
9616
5154
10577
8990
8991
7455
7450
5892
12729
10485
8519
8512
8587
5802
13325
7507
5622
3880
7923
6451
8666
8674
15489
16505
6599
3879
3873
6178
13889
7026
7027
15836
8441
8434
5820
8444
8835
8836
14387
9546
12834
4526
9531
9532
16477
10074
11161
9857
15148
8576
6077
12127
10938
9348
14725
8163
9529
11500
11507
7474
9923
12848
8458
11978
9111
12812
9027
9977
7130
7131
7137
11021
9834
14349
13551
9825
9824
12469
11227
10109
10107
11567
9502
12346
11555
631
2934
2942
2962
2948
1942
1964
2312
2344
2413
1458
1436
2847
2899
2861
2814
2874
4581
4561
4335
4387
4399
4344
4379
2506
2512
2544
391
3947
3981
3987
3942
3997
2717
2742
2751
2714
4854
4802
4856
4844
4846
4897
4808
4863
4876
4874
3252
3287
3249
3295
3298
2063
5287
5286
5277
4753
4713
4756
5358
5398
5391
3379
3011
3091
3060
4619
4604
4690
4692
4614
2685
2661
2614
2668
4250
4290
4293
3511
3587
3557
3558
16119
16120
5982
5935
5945
5950
5946
5977
3764
3751
12688
12601
12672
6249
6265
6232
1855
7289
7235
7209
7296
7279
7276
2118
2180
2110
6688
6664
6698
3488
3459
3440
3400
3414
1066
1064
10645
10610
10643
10655
10600
10660
8009
8007
8014
8030
3152
3145
504
5087
5010
5040
5086
4481
4483
4497
4431
7615
7610
7661
7650
7643
7666
7678
3630
3636
3674
5506
5589
5564
5562
5554
5598
5575
5576
14014
14096
3700
5719
4599
12759
12749
16966
4140
2766
7918
7906
7981
7989
7902
7955
7997
7977
5682
5687
5685
5645
5651
5637
4906
4999
4950
4900
4997
4996
4976
8354
8367
8331
13330
6959
6962
6997
6998
6991
6978
10213
10245
10209
10237
13417
13446
7751
7797
7765
5447
5461
7015
7055
7094
12253
2264
17679
14250
14224
9288
9213
9280
9257
9237
1599
4538
15395
8783
8748
8794
13005
17337
14606
1076
10741
10703
10750
10744
10776
827
8283
8256
8201
8266
8275
8278
3477
2468
4333
1171
11788
11780
11779
5864
5863
2293
9313
9334
9301
9372
9339
11699
7333
9707
9755
9751
9768
9771
9773
3128
3120
11365
1727
15784
2486
13714
13798
13772
11864
10063
908
9009
9002
12347
12311
12352
12399
11582
8379
10806
10853
4057
4001
4086
6553
6545
7443
4725
4721
5411
9032
7181
7183
6317
6353
6352
6361
6368
6374
6373
15207
11880
3921
7511
7549
7557
4060
4067
8918
8941
12487
4428
8635
8680
8182
8196
3029
7876
7622
11959
11915
11910
11967
10028
3226
3223
5195
10031
17518
9485
7343
15843
6431
14541
14519
14513
9640
3528
13847
9568
6233
9333
6126
11928
6485
6445
6409
9962
11108
11107
6520
6041
6089
6049
6086
5425
8528
6898
6899
13479
7198
9494
9582
9559
9509
9504
10582
10589
10550
8876
15124
8149
10082
10012
10009
3865
8951
5176
9093
10597
6427
14434
8813
9475
9471
6020
6096
10879
10871
8176
8173
10850
10918
10911
10984
4029
9558
5143
9598
10486
9658
8854
5025
5027
8885
12825
14972
7865
7866
10364
10310
10309
10363
4820
11059
10927
5151
10222
8993
8994
3848
14507
11342
11343
3831
6117
13548
10406
9625
9623
8404
6328
6876
8557
13910
6555
14457
7927
6514
7405
7407
10478
11804
11092
19881
7596
7592
5845
3875
4185
12907
8435
5824
14389
13822
10357
13677
6816
7514
11119
6191
8478
8575
6858
3626
12128
14523
7125
8416
8410
8938
7428
7420
7473
7801
9929
8853
13426
8450
11974
7568
8431
9575
9572
11156
14423
12472
7551
9831
10993
14372
10813
13579
12971
12973
11129
10986
11725
14825
12500
8150
11560
12327
12323
9501
12348
14197
10823
12151
9514
11404
14104
15029
10448
10960
13608
16048
14448
605
2917
2919
2911
2913
1982
1151
2395
4582
4583
4549
4562
4303
4354
4386
4305
4372
2207
1558
2566
3913
3952
2703
2702
2790
2730
4842
4848
4875
4877
3234
3255
3214
2016
2058
5247
5240
5262
5201
5297
5239
4788
4700
5303
5315
5304
5316
5378
5377
3384
3386
3305
3042
3061
4606
4664
4601
4669
4639
2653
4285
4244
4251
3506
3573
5999
5972
3745
3795
3758
12654
12676
12678
6257
6243
6255
6267
6220
1861
1838
7249
7277
2100
668
660
6653
6602
6669
6676
3409
3462
3408
10661
10630
8035
8087
8049
8056
8055
8094
8074
8024
3113
3165
5089
5048
5046
5094
5072
4411
4459
4487
4434
4404
4450
4498
4432
7683
7612
7687
7684
7642
7665
7670
7673
3689
3685
3664
3616
3691
3671
6762
6724
5544
5597
5514
14053
14095
14004
14054
3704
5711
5759
5754
5743
5767
5714
5786
5724
3174
4592
12745
12761
12792
12798
12786
12730
2479
1695
4142
4151
4130
7913
7916
7993
7969
7905
7979
7973
5699
5643
4904
4939
8383
8384
8399
8343
8301
8348
8392
8386
1339
1334
13345
13340
13355
13346
13368
13324
6989
6913
6995
6948
6932
10299
10201
10292
10296
10238
10230
10208
1340
13441
13481
13485
13495
13444
13436
7782
7731
7773
5433
4315
4477
7011
7012
7052
7087
7054
7092
7091
7075
7008
12268
17654
17607
17678
14205
9247
9241
9264
9207
9200
9267
2276
15316
8712
8734
8704
8755
8751
8769
8770
8724
13011
13012
13057
13004
13002
13001
13073
17305
14611
14602
14669
8245
8273
2001
14782
14742
14780
10144
10166
1630
21285
13285
13205
13276
5248
5256
3358
12841
12819
12859
12852
3605
5927
11735
11745
11744
11793
11705
9384
9369
9330
11289
11253
11293
11238
11231
11275
11270
11607
11694
11630
2325
2326
7347
7318
7319
7361
16270
9780
9748
9746
9794
11313
11315
11304
1725
17278
6862
15717
15756
15720
11417
11483
11487
8829
1371
13789
13785
13746
13792
13778
9088
9080
12380
1930
12006
12049
12051
4084
4045
4016
3796
6518
6582
6506
6585
7403
7453
6313
6300
6396
6360
6333
15245
6060
3137
7518
7540
7811
5525
5529
9225
3324
8945
8914
4429
13681
13650
13667
7575
9357
9354
5327
5839
8606
8619
8689
8604
8607
8693
8665
8636
8194
7147
7159
11945
5190
10038
6355
6351
6357
3805
15921
2624
3890
9156
9403
14540
14556
13806
13819
13864
9566
9567
3371
6125
6123
9983
6469
6463
9852
9865
6006
6010
6058
7533
8537
10323
9895
6894
11000
8842
9402
8625
8616
8100
9547
9512
6829
10517
10541
10564
8872
9103
10974
8152
8140
8144
12093
9840
11539
10059
10010
8950
11071
5175
5177
10590
14459
14442
16602
7448
7883
8499
8810
9476
9801
6093
9198
10890
10899
7414
12071
10959
10987
10945
10943
6725
6726
11414
14963
19031
9682
9612
9699
9602
4090
12132
11165
15542
15557
18038
8809
8856
13894
6400
6407
5028
5020
12826
7323
5122
7817
7864
7862
10362
10361
10300
10393
6497
4126
9663
5156
10800
8110
10574
5478
3843
11340
3836
3832
9078
9079
10096
6103
6119
6159
9675
8405
6872
6873
8562
8974
13983
13913
13952
13987
13984
13902
6551
14456
5626
6457
9999
12197
16530
8675
8670
15485
3854
11838
7594
6590
12101
5848
5849
12420
8422
8424
10190
7022
4182
12911
12980
12961
12014
10116
13165
13167
10880
5879
5872
5874
5825
5826
5827
8833
15590
5167
14352
14332
16514
5109
10558
18344
7157
7154
6813
12838
12832
9930
9933
14228
15040
13025
10078
11471
11473
16730
11147
11159
8026
9858
9850
9851
14123
6199
6197
6194
12226
8479
16468
14881
14883
9486
11199
11194
7172
11598
11591
6850
14648
17164
7899
12511
12515
14432
11816
11172
7128
10407
13060
13061
9131
9346
14179
5811
5814
11185
12923
11871
13176
15156
10560
9921
8862
17855
9115
8960
9029
9023
10436
15421
6560
9976
15166
14427
15490
15460
12477
18447
11486
12622
9826
9439
6885
13846
13855
7438
12463
6546
11130
11137
8154
11569
13805
13800
12886
13126
12176
13131
17971
14188
10625
10626
20836
17546
658
814
2941
2903
2959
2910
2990
2905
2939
1677
1986
1191
2313
2385
2362
2393
2406
2481
2453
2888
2883
2887
2880
2895
4506
4512
4515
4347
4349
4346
4390
2253
2254
2518
2565
3934
3980
3999
3907
3900
3979
2781
2709
4845
4850
4869
4830
2050
2086
5214
5263
4789
4784
4715
4702
4744
4701
5310
3347
3389
3349
3392
3398
3391
305
3003
3085
3090
4655
4651
4698
4632
268
2683
2659
4253
4211
4213
4215
4280
4298
4232
4296
4275
3518
16152
16150
16138
16163
5953
5943
5916
5939
5979
3717
3710
3774
12618
12609
12640
12693
12669
6235
6240
6262
6254
6216
6207
6251
6230
6260
7259
7254
7261
7244
7200
7269
7294
7270
7239
6617
6641
6683
6634
6657
6640
6655
6668
3443
3401
3497
10617
10647
10619
10688
10689
10659
10634
10642
10649
10604
10608
10620
8017
8045
8051
8072
3140
3191
5035
5004
5000
4453
4484
4495
4448
4469
7618
7659
7664
7654
7697
7632
7672
3692
3632
2836
6717
6711
6787
6702
6751
6769
6714
6766
6786
6775
6773
5534
5542
5561
5548
5500
5565
5586
14059
14049
14094
14086
5789
5742
5704
5750
5736
12741
12713
12751
12797
12779
1691
16959
16901
16971
4190
4196
4138
7983
7942
7985
7980
7962
7950
7967
7994
7938
7937
7976
5617
5606
5657
5654
5698
5663
5673
20241
4903
4953
4935
4954
4990
4970
8303
8359
8335
8309
8390
8397
8314
8337
8336
13357
13362
13361
13393
13375
13378
13373
6904
6951
6990
6966
6938
6986
6960
6939
10206
10235
10284
10264
10280
10216
10214
10294
10260
10263
10224
13445
7753
7707
7790
7793
7769
7708
7774
7724
549
5482
4310
4311
7001
7096
7072
7079
12245
12299
12251
12258
5226
1765
14241
14288
14235
14242
14264
14216
14239
9203
9283
9252
9287
9202
9246
9258
9290
9296
9291
9274
15982
15985
15949
15910
15909
15904
15970
15979
4530
15334
15315
15331
15372
15333
8706
8759
8787
8756
8744
8797
13047
13045
13051
13058
1736
17365
17308
17333
2674
2726
14624
10747
10783
10749
10768
8218
8206
8234
8242
8280
8243
8248
8255
3472
14745
14731
14786
14705
14770
10149
10165
1631
16395
16304
13282
13209
13254
13237
13273
3355
12847
12862
12865
5920
11712
11707
11755
11746
11730
11773
4851
5817
5861
9353
9383
9387
9385
9364
9390
9331
11259
11287
11245
11264
11248
11611
11642
11615
11698
11632
18081
18087
7352
7335
7399
7300
7332
7370
7339
7378
7373
9717
9783
9762
9761
9744
9758
9793
9738
9736
9779
5182
11388
11311
11387
11314
11377
17267
6841
6803
6868
15713
15715
15704
15744
15755
15758
15797
15705
11403
11453
11484
13717
13706
13711
13704
13707
13748
13732
13791
11818
11860
7829
7824
10066
10064
9089
9015
9045
9001
9058
12341
12381
12384
12307
12390
12394
12331
12324
4578
8378
10178
12081
12089
12004
12050
10803
10852
10865
4018
4049
3791
3425
3423
6587
6584
6510
6562
15863
7441
7481
7487
7440
7185
2236
6319
6372
2960
13518
13553
13509
13504
15214
15231
15268
15275
7850
6064
7736
7737
7517
12106
12119
5520
9221
2660
11950
8913
8934
8984
8949
8966
12464
9178
9174
13647
13655
13690
7573
9355
9358
9351
16423
5326
2971
2977
5835
5834
8602
8651
8632
8631
8637
8120
8195
8198
8199
2426
14117
14142
14162
14144
7161
12590
12591
10530
10537
11918
11989
11912
11984
10026
10037
6358
6575
6579
3800
13162
13146
9155
9447
9442
7346
6928
6430
4036
14585
14550
4777
9648
9646
8543
13594
6415
6414
2925
2922
13196
7111
6120
9885
9887
6452
9810
9812
9813
9959
9940
9967
18250
13529
9819
6047
6015
6054
6001
11627
7536
10328
10324
6624
10426
10427
10422
5421
8529
16404
7062
6114
9407
8627
8105
8109
8101
8500
9495
12495
12491
10583
10542
15128
15122
15606
15686
7493
13646
11322
17865
8640
10019
10081
10049
10086
15829
16354
11075
13970
11356
11350
7848
14445
6535
14817
14862
16654
16658
16669
16631
6032
8491
8493
6029
9808
10876
6134
8175
8171
9190
9191
9194
10894
10858
10857
12076
14981
14934
9458
12457
11412
5106
5153
9590
9599
9592
9654
9656
9600
4094
12136
12130
12131
15562
15504
7228
14939
14933
8851
13890
13891
13892
9720
6408
8884
12820
14975
8595
8225
7327
10311
10304
10316
10332
4127
4123
7726
7727
10410
11089
11011
9666
10807
15342
10573
15888
12358
12354
8329
5895
10447
10481
10409
10461
10443
9624
9678
8401
6326
13535
13831
11068
5134
15000
8583
8542
8585
8545
8550
8977
13982
13989
13943
13916
9061
15174
13326
13322
13323
14110
14113
3888
7928
6008
6458
11646
12116
7408
8676
11098
11839
18552
12425
11846
3870
3874
8426
8429
8421
8427
10192
7028
7021
12952
12964
12948
10886
10887
5876
8489
8443
5828
8839
5169
5163
14306
14395
14365
14305
12433
6229
6805
6807
6802
6804
16047
20397
7156
10371
10372
9936
9939
9931
9937
4529
4521
9538
11444
10070
10071
17886
11476
11472
19192
11141
11140
11143
8029
8022
14127
8572
11196
7175
6071
11426
14622
14643
10498
10468
10469
4927
12512
12545
14169
4048
14526
18399
18397
18337
8412
13069
9130
14175
15478
15476
12028
8168
8169
9525
9522
5855
9448
11181
12920
11508
7863
9920
15408
8819
13423
13863
10842
10844
17166
7566
8430
9114
14028
14021
14027
12811
12813
7463
9028
15427
9573
6566
14876
14877
11498
15167
14590
15492
15494
10189
9835
9839
9833
18856
18854
9109
12986
14344
7166
11520
11523
15104
10998
13185
13555
9120
9129
11111
9431
14130
6887
13849
13842
13858
13994
15801
7431
10815
12532
12975
12972
12974
11123
18502
11996
11992
11729
11226
11229
12508
14067
11563
12322
9505
9500
9507
9463
12411
12412
12881
13123
14807
14802
15520
12179
11439
17975
12150
17077
12188
9876
11405
14327
12544
18595
18698
18696
13563
17444
12855
15696
638
1214
2914
2931
1670
1975
1977
2339
2378
1439
4511
4542
4509
4550
4306
4381
4389
4361
4366
4308
4363
4371
4373
2242
2200
2545
2554
2563
3912
3984
3955
3967
1708
2782
2719
2794
2733
4882
4811
4864
4809
4862
4865
4866
3281
3202
3244
3297
3275
3236
2078
5217
5218
5282
5234
5280
5290
5205
5278
4717
4747
4741
4738
4776
5347
5305
5308
5379
3303
3319
3337
3095
3069
4689
4609
4654
4668
4608
4633
2619
2666
2696
2605
4281
4242
4202
4200
4297
4205
4277
3569
3594
3591
3571
16189
16187
16195
16116
16155
16190
16100
16197
16193
16194
16191
16160
5918
5903
5954
5969
5938
3789
3712
3749
3770
12641
12652
12635
12687
12634
12649
12607
12651
12697
12696
12630
12670
12673
628
6247
6219
6211
6252
6210
6258
6238
6231
6272
6236
1848
1891
7217
7241
7219
7280
7265
7232
7291
2195
2199
2161
2151
2194
2435
2439
666
6689
6645
6650
6601
6666
6608
6679
3418
3487
3415
3456
10603
10653
10683
10611
10635
10687
10664
10680
10650
10656
10616
10601
10692
10666
10632
10624
8081
8084
8004
8032
8038
8031
8076
3134
3180
3157
3102
3107
3114
5018
5049
5056
5091
5063
4403
4488
4499
4401
4446
765
7685
7699
7656
7648
7646
7658
7690
7600
7693
7674
3654
3658
3697
3696
3673
3624
6713
6745
6732
6738
6737
6770
6774
6771
6777
556
5583
5595
5599
5507
14047
14006
14003
14009
14099
14002
14058
5781
5740
5716
5751
5771
5773
3179
4597
12788
12781
12711
12712
12784
12785
12710
12704
12701
12775
12772
16957
16904
16943
4112
4199
4150
4197
4198
2767
7947
7987
7992
7998
5644
5607
5646
5690
5638
5668
5630
5670
5636
20287
20299
490
4934
4962
4943
4916
4944
4946
8318
8341
8350
8302
8355
8369
8391
13347
13341
13311
13312
13387
13395
13304
13394
13305
13372
13339
696
6917
6981
6912
6934
6901
6900
6965
6994
6905
6908
6963
6970
1026
10217
10247
10288
10283
10259
10215
10240
10250
10248
10290
10293
10239
10277
13483
13484
13404
13450
13401
13400
13498
13437
13433
4266
7747
7757
7709
7756
7755
7746
7792
7794
7705
7778
5435
5485
5495
5402
5492
5491
5365
5360
5362
5364
7018
7080
7040
7058
7070
16819
16846
12217
12281
12283
12284
12295
12204
12246
12292
12238
12279
12224
2262
5220
17601
17648
17658
17631
17671
17620
1423
14206
14287
14249
14280
14257
14261
14290
14265
14298
14238
14274
14277
5338
5332
9282
9235
9284
9240
9204
9254
9216
9255
9293
9265
9298
9231
9230
9275
9276
2271
2274
15941
15964
15944
15993
15914
15998
15930
2516
4531
15317
15382
15319
15381
15313
15361
15302
8781
8711
8715
8749
8764
8743
8716
8792
8768
8772
8771
8777
1308
13049
13055
13008
13072
13076
13078
17334
17395
6290
14682
14641
14681
14684
14685
14604
4621
1073
10717
10785
10764
10748
10790
10714
10708
10737
10770
10771
10773
8211
8295
8257
8209
8293
8294
8291
8279
14718
14788
14711
14795
14709
14762
14702
14743
14748
14766
14768
14736
10141
10103
10145
10164
10143
10167
16386
16339
13253
13213
13287
13245
13264
13257
13262
13261
13256
13201
13248
13269
13270
13236
13274
13224
3356
12818
12803
12853
17789
17785
3601
6470
4330
11706
11703
11784
11715
11740
11754
11702
11758
11797
11767
11765
11794
11766
11731
11768
11791
11736
5868
5860
9306
9381
9359
9309
9361
9332
9368
9337
9370
11282
11203
11252
11257
11204
11255
11246
11267
11269
11214
11286
11272
11276
11233
11682
11688
11612
11695
11662
11669
11668
11678
18006
18084
18010
7380
7309
7362
7367
7314
7398
7368
7375
7377
7324
19250
16206
16284
16210
16251
16298
16236
9747
9782
9784
9709
9740
9743
9700
9714
9760
9778
5186
5189
5187
3124
11312
11384
11364
11310
11316
11331
11386
11336
17211
17295
17299
17262
17290
17220
6819
15787
15734
15757
15750
15790
15793
15738
15768
11447
11435
11485
11445
11461
8825
13741
13742
13740
13758
13767
13708
13763
13779
13720
2131
11817
11882
10068
10060
10062
9081
9011
9052
9040
9054
9086
12317
12388
12395
12304
12338
12330
12308
12337
12370
4572
11517
11518
11519
11516
4225
10174
19313
19333
12084
12058
12086
4047
4563
6503
6588
6583
6554
7417
2228
4729
2523
5419
5412
5414
18749
9035
9030
9033
9034
7188
6387
6334
6302
6393
6330
6376
6378
20859
9411
13506
13503
13516
15217
15219
15281
15211
15212
15213
15287
15258
15260
11883
6065
7730
7513
7585
7515
7550
7814
12141
12145
5524
6344
4065
11951
8953
8959
8912
8942
8965
12418
12485
12462
12443
4676
9170
9171
13688
13652
13645
13686
5321
8683
8652
8662
8661
8126
12990
12997
12994
10126
7870
14152
14148
16524
7117
7144
7146
12592
12593
10533
11917
11982
11903
11988
11913
11935
11942
11985
11940
19144
5199
9182
6578
6576
6573
13147
13119
13140
13143
13144
12774
2620
2623
9441
9481
9459
9464
9462
6925
15555
4733
14587
14580
14516
4771
8546
11828
11820
11824
13593
6416
9563
10043
2926
13193
7112
6128
6127
11921
11924
9884
6481
6489
6453
9816
9811
9915
9907
1823
18216
6466
8895
8898
8896
11105
13524
3733
18646
9861
9866
6525
12908
6018
6083
6056
7830
7530
7534
8531
6621
6622
10423
9899
9891
19083
8526
16402
6897
7068
7060
7064
8845
8849
6835
6833
8629
8621
8623
11333
13478
7192
9490
9517
9518
9506
9584
9561
12492
12494
6828
6826
10519
10504
10554
8873
9143
4133
15682
15681
15611
15642
15609
15692
10976
8147
8141
8146
12091
12097
7490
7492
9845
9846
9844
11328
11323
11324
9900
11537
11532
10017
10084
10054
10050
13109
13101
3818
3862
3861
3867
8954
18472
15225
16356
11076
9098
7845
9168
6426
6420
14447
14482
14449
14853
16647
16638
7446
10135
10134
7888
7884
8497
8811
3811
3812
6023
20062
6091
6092
10872
10874
8170
9193
12871
12873
10896
7411
11938
11930
12079
10947
10989
10985
10949
10940
10902
10944
14918
14959
14909
14916
9456
12458
12454
11411
5148
5146
9596
9593
9613
9642
9657
9604
9650
9601
9667
9632
9686
11169
11167
15517
15506
15583
15550
15516
3725
14404
7221
13227
13223
14468
8800
10508
10500
9728
6402
6404
15568
15566
15539
5029
8566
8560
8563
14531
8883
7546
14977
8596
8590
8591
8594
13668
8226
5128
5127
7818
7803
7869
15068
10303
10319
10381
10352
10365
10337
10336
18659
18651
6492
4826
9421
9423
9424
10412
10413
11082
11019
11052
10922
9614
5150
17417
17449
6501
17065
8996
5474
12061
15810
11344
12355
12357
3833
9075
9077
10092
6153
13546
13543
13544
12726
10417
10441
10453
10484
10442
10445
18162
18143
4075
4076
4077
4073
6444
8402
6327
17047
17089
17057
18327
13832
13833
11065
11069
11064
6874
5130
5139
5131
8582
8511
8975
8978
8970
8979
8971
19184
13906
13941
13919
13962
13907
13901
13948
13967
16728
16729
16721
16723
9065
9063
19441
19445
16433
14455
16442
9633
11450
11451
15646
7922
8663
9996
12198
12194
11644
8722
8723
12114
12525
7404
10473
16539
11802
11093
3850
16500
15622
8558
11830
11832
16329
6595
12107
12426
10458
6175
6176
10193
7023
12982
12942
12949
12902
12969
15834
8406
8459
8452
8449
8464
8480
5821
5822
9586
15099
7524
8838
8837
14317
14388
14335
14385
14362
14338
14339
10728
10721
6226
13825
10355
10356
10351
6165
16006
16088
16045
16056
20341
18165
5102
14565
6815
6810
12839
12831
13623
13624
14227
14223
15053
15087
15002
15001
15086
16472
10079
7037
17881
16717
16735
16780
16708
16778
16771
16886
19194
11152
15670
15671
15674
10544
16829
6193
20178
8471
8473
14885
14884
15142
15149
15164
8863
15856
11193
18578
7170
6076
16584
11425
6851
19968
19960
11898
11899
11891
3621
14646
9955
9958
12565
12568
12569
10499
4925
4921
7895
7893
12564
12120
12122
10939
10937
11813
12936
12933
15430
15437
10348
17024
18330
7126
7120
7124
10404
11858
11856
11857
8413
9133
9349
8931
8932
10520
14172
14722
12025
11030
11031
15030
15033
9521
13696
13691
12809
12807
11187
11183
7425
12405
16178
19023
17621
11505
15150
10957
10563
15660
9928
9926
15401
15402
8882
8803
11468
11469
11463
8466
8467
11576
11570
19906
19969
17160
14846
8451
8438
8432
9110
10838
10832
17416
17195
17196
7460
9020
9021
12895
12893
10433
11968
13954
15138
20768
9577
13508
13507
6567
9979
7132
16025
14875
14873
11490
11499
16555
16551
11158
14596
14428
14422
15495
15496
13725
13726
10185
10188
10187
11026
11020
20164
12571
14340
14498
18489
18443
13929
11522
15107
10996
10990
14378
14371
14374
18871
17227
13189
13183
13184
12621
12627
9821
9125
16836
14136
14514
6888
6881
8694
13848
13840
13996
14478
14474
17345
19626
7430
7432
7433
14928
14924
18405
12465
10811
13908
12531
18433
11722
14820
14830
14833
11223
16895
10108
10102
14065
14062
8151
19530
12325
12329
12321
9465
9466
9321
9323
10000
19842
13809
13801
13807
12415
12410
12413
14850
15899
17530
9008
12178
12342
19500
15415
15570
8586
16596
14190
14199
15879
17830
12157
12154
16079
17498
17072
12186
10905
11614
14325
14328
17525
17526
17523
17422
16069
16063
13419
13414
14415
14357
12043
12044
16410
10444
14578
18599
17037
17005
20879
20576
18137
15544
17351
19173
15508
16636
865
1291
2943
2955
2958
2993
2967
2975
1965
2383
2331
2360
1351
2499
2493
1433
2853
2811
2809
2844
2851
4588
4589
4554
4544
4508
4353
4334
4357
4309
4343
4392
4367
4365
4394
4370
2201
2551
2576
2571
3911
3910
3990
3932
3968
3975
3963
3933
1751
2716
4817
4819
4885
4810
4838
4873
3288
3212
3216
3207
3246
3294
3286
3205
2043
2048
2096
2070
5206
5212
5213
5284
5215
5292
5298
5274
5233
4703
4752
4757
4754
4716
4775
5353
5352
5349
5309
5348
5370
3388
3311
3352
3354
3394
3012
3057
3040
3051
3097
3065
3030
4603
4687
4696
4686
2697
4283
4284
4210
4209
4294
4272
3561
3556
3546
3566
3579
16141
16159
16157
16109
16199
16161
16101
16146
16169
16114
16198
16166
16105
16130
16137
16136
5917
5981
5983
5957
5902
5907
5990
5992
5998
5932
5963
5970
3781
3742
3756
3746
3769
3732
3730
12647
12619
12683
12684
12615
12645
12657
12604
12661
12650
12690
12665
12668
12605
12675
12636
12674
12677
12624
6217
6281
6213
6284
6209
6246
6214
6266
6208
6263
6279
