[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
12
29
19
23
10
16
11
9
32
39
161
48
126
243
43
6
5
106
8
72
13
283
282
66
28
459
370
317
62
247
140
50
46
1
169
76
80
47
202
276
59
217
300
45
127
134
431
426
536
67
230
447
133
24
52
522
227
251
432
226
253
453
533
358
168
25
176
629
272
55
462
102
53
267
153
79
421
173
130
334
101
524
347
335
525
360
44
200
107
592
163
647
485
246
254
433
142
128
304
478
146
574
4
344
58
70
2
518
725
275
229
177
180
122
248
212
56
232
882
263
312
444
68
451
114
1006
118
481
249
782
470
35
457
115
49
1017
355
837
213
33
90
192
415
379
307
108
162
193
158
83
456
800
422
116
416
342
159
348
455
87
120
541
172
74
903
718
3
65
34
472
208
296
454
215
941
223
135
698
222
228
252
565
546
42
69
285
1188
14
279
785
314
277
394
773
606
595
92
794
264
781
336
121
354
350
552
313
813
220
7
618
1475
922
1195
634
553
266
448
31
221
124
776
75
366
329
117
1124
917
345
390
392
57
1642
274
406
332
471
442
311
521
82
353
540
804
771
467
935
330
535
1299
1596
255
89
189
757
548
511
812
818
147
583
331
1652
1012
499
434
819
141
1203
309
787
435
41
594
464
136
476
571
191
338
1259
762
1053
93
532
1661
299
579
71
971
1002
665
119
260
308
73
396
361
398
333
831
2319
1277
297
295
561
918
439
1499
187
635
131
1592
461
175
250
691
1003
27
495
209
241
224
494
137
550
615
1227
1584
591
240
328
915
938
1644
86
1555
657
2162
473
1178
734
37
965
678
36
63
964
94
643
1182
30
854
365
138
477
1359
575
440
280
956
145
692
132
623
538
519
424
933
671
380
705
1319
505
1430
1021
1051
1024
998
1338
806
236
373
98
1192
1004
1864
337
641
988
1068
1325
1290
981
889
1645
578
341
1110
1352
878
739
290
123
1104
40
382
322
403
711
1593
652
690
853
1426
646
1100
1162
233
190
302
1236
675
1032
1042
1759
783
829
989
239
836
1038
1130
1640
761
3034
1263
1101
291
706
875
861
1365
707
2643
626
2169
539
689
542
1377
395
599
113
389
611
1698
940
1133
669
526
862
884
315
830
1619
20
852
270
1326
850
1495
1174
683
810
662
1958
920
790
1425
2538
77
612
423
507
413
753
1347
405
1329
157
1424
196
1680
352
1249
466
1226
1364
468
949
319
1570
178
1311
990
1209
2641
1275
1512
262
265
736
26
357
1097
1310
292
359
1582
437
1847
566
1522
1635
1575
1574
237
984
601
914
1286
91
895
909
99
887
474
799
864
749
1129
100
1135
397
2260
590
1132
2124
760
1153
679
1223
593
719
1121
1239
916
1600
1667
493
1027
1403
374
156
310
744
1107
653
1397
1536
95
500
921
148
367
588
784
2006
881
1274
105
823
877
2213
1059
1228
693
808
1675
980
1935
2175
144
625
261
573
723
483
1405
225
642
788
491
1287
22
1648
969
1013
955
1525
1794
1496
1903
817
979
1160
1085
945
1087
1207
684
197
798
826
1048
2415
1141
1193
281
1089
1370
349
947
2420
2483
2037
369
1440
1154
1758
1245
1431
741
166
458
1928
81
1322
2436
149
1732
1213
1446
682
661
674
919
1610
1803
849
2089
356
1050
534
1361
602
2418
672
155
2113
2636
824
904
880
2583
598
64
708
959
2879
568
1094
1168
1438
1491
2283
1493
1553
1116
18
609
2170
767
1268
1899
1366
1389
1770
21
231
288
754
972
1125
1453
506
1556
371
613
2059
411
531
885
1478
2421
2732
393
722
1786
1497
1506
1622
603
1769
2351
856
235
1934
1001
503
640
729
1545
97
859
438
327
1282
1534
2208
2909
966
888
1894
2008
822
54
60
475
301
873
961
1822
502
517
1324
1476
1479
1041
1581
2290
1760
1461
1588
1881
15
1170
1394
1706
2197
649
777
1568
174
1092
1649
78
1080
2041
650
1450
2066
2250
2434
3284
186
1235
3444
710
1022
1618
408
942
2210
1233
2409
1985
586
1009
554
772
449
1139
928
1811
991
1354
1470
648
907
1231
1868
1415
110
2023
1206
1993
3917
809
1134
2187
1057
1401
381
899
1666
1842
1105
2448
811
1723
1819
323
726
1763
2235
732
986
2334
3173
770
1804
109
1272
2460
164
181
1307
3381
497
644
3289
1190
1603
214
482
1383
1832
508
1378
384
559
520
1877
3452
1500
1918
2229
2363
2764
523
1267
1353
479
412
428
194
2198
1331
1643
1672
1701
1854
378
446
962
1787
1883
963
1345
614
1276
2042
2575
2612
2746
170
655
2069
832
1517
1801
2820
1870
2172
486
1106
1145
1564
1948
1990
651
1780
17
179
906
1164
1793
2038
205
1551
3882
567
1445
2349
2572
443
608
620
897
2046
3478
218
840
866
1058
1295
624
967
1158
1448
1693
2000
2328
2945
791
1411
216
687
704
925
1016
1252
1323
1662
3331
219
3171
512
600
1300
3931
1812
2047
589
750
1198
2601
673
1332
1613
2214
2487
104
636
855
1421
1798
3026
560
1507
1654
1789
2309
4108
1396
286
1636
2116
376
1660
1988
2595
632
1075
1180
1219
1562
1650
1653
2667
758
937
2471
977
1063
1576
1632
872
968
1025
2992
465
740
779
792
795
1045
1210
1251
1466
1756
463
2403
745
2056
211
427
1201
2570
1183
1943
3138
154
2111
4942
2022
2280
2885
664
1047
1376
1731
2706
851
1211
1724
2109
2681
1242
1294
2306
2816
3087
3096
3361
242
821
926
1123
1467
1795
2401
2828
3092
3702
551
844
1316
3093
3105
999
1363
1388
1514
1527
2039
2600
1208
2181
2604
2611
4079
269
709
2080
2590
3544
326
372
515
923
958
1109
2536
4622
1184
1368
1391
1583
1671
3492
3750
4262
61
2122
2535
3828
3856
287
828
2655
2765
2807
3950
543
1509
1685
1907
2126
2731
3024
3270
954
1163
1248
1381
318
1577
1651
1878
2125
340
441
724
975
1745
2029
2098
2114
2454
2464
2779
2580
2613
3271
630
939
1008
1243
2067
2704
2918
838
890
1205
1559
436
805
2346
2354
139
751
1011
1019
1055
1816
1817
2065
2317
2687
4635
429
584
1728
2527
3016
402
484
766
1035
3804
185
825
2470
2682
188
324
973
2102
2316
2799
848
1088
1367
1913
2269
2707
3151
1526
1834
1518
2407
2616
2996
3639
96
1015
1328
1665
1684
1699
1774
4681
1072
1414
1456
1465
1572
1696
2119
2860
1362
1967
1302
1382
1615
1851
1872
2375
2679
2776
3919
1422
2463
3329
3617
670
702
871
1473
2813
1200
1839
2921
3669
5168
645
1501
2152
2177
4727
1144
1333
1605
2692
3308
3474
582
803
1061
3479
1128
1656
1688
2075
2327
681
759
993
1647
1705
2347
3013
4141
883
886
1626
1788
1919
2061
2680
2882
3620
4091
469
727
1186
1687
1747
1920
2017
2191
3829
3954
386
1222
1278
1597
2949
51
676
1031
1054
203
1682
1829
2178
3402
5070
417
489
1398
1412
1739
2343
2693
3224
3604
3714
363
1567
1585
1858
1995
2988
3470
4224
5307
85
234
2288
2835
3043
3175
256
273
948
2073
2121
2148
2281
4682
527
1194
1264
1905
2769
3738
3748
514
738
1283
1387
1710
2397
3543
3797
4369
151
278
802
1037
1646
1729
1857
1954
2077
3062
3074
4092
528
622
1504
1805
1906
2115
2308
2987
4160
680
1996
2209
2573
2906
3315
4207
4894
5066
5249
271
420
953
2030
2912
3248
3667
88
985
1462
1802
2011
2027
2176
2513
2585
3215
3611
879
1336
1488
1676
1874
2117
2320
2540
2658
2718
3641
4252
4337
425
715
2773
2789
3041
3116
3123
4000
4324
1256
2074
2272
2289
2785
2957
3581
4015
204
545
569
960
1036
1464
2358
2449
2864
3276
3918
4230
4781
5158
5257
633
1142
1321
1637
1911
2615
3498
3724
3747
4891
5553
6269
480
1416
2105
2142
2369
2501
2629
2940
2984
4226
995
1014
1443
1624
2504
3316
4019
6461
450
876
1147
1189
1520
2060
2392
2405
2795
3141
5145
5912
580
1358
1379
2156
2408
2560
2806
2819
3168
165
171
544
1543
1625
1718
1929
3143
5194
5624
5980
6002
487
501
797
1260
2005
2357
3253
3343
3368
4468
103
160
339
931
1528
1730
2630
3494
3964
5325
460
728
1023
1034
1998
2082
2361
2850
3502
4068
4325
6755
1400
2461
2534
2866
3359
3898
3920
4136
4596
5354
748
857
1007
1120
1304
1560
1664
2101
2192
2745
2775
2833
3340
3375
3814
6100
7106
320
572
775
1136
1320
2230
2411
2488
2626
2656
2979
3679
3701
5439
8092
111
150
298
610
730
796
842
1185
1702
1748
1814
1914
1972
2019
2045
2333
2472
2598
3220
3250
4169
4175
4299
5105
383
488
1463
1979
2190
2973
3514
4749
4858
5531
5967
112
577
1548
1833
1902
1976
2241
2727
2830
4195
970
1046
1181
1468
1835
1970
2444
2845
3536
3559
3871
3970
5138
5312
944
1503
2647
3055
3162
3360
3525
4163
4728
4803
129
351
509
537
833
1093
1293
1369
1927
2356
2400
2878
3387
3421
3883
4206
4558
5198
5496
616
1177
1212
1224
1762
2064
2291
2292
2651
2676
3277
4097
4149
4172
4455
4691
913
930
1049
1103
1119
1137
1202
1472
1523
1697
2034
2282
2502
2610
2688
3158
3614
6591
596
847
929
1386
1547
1686
1974
2107
2332
2686
2728
2740
3056
4026
4159
5808
258
587
617
867
934
1173
1280
1452
1594
1617
1694
2244
2424
2437
2532
3015
3708
3757
3761
3778
3803
3993
4834
4964
321
419
530
816
1060
1515
1796
1897
2040
2596
3351
3608
3610
3815
4338
4814
1709
1776
1904
1915
2165
2204
2427
2805
2839
2865
2969
3378
3709
3885
4355
4454
5084
5171
5227
6656
1240
1306
1337
1853
2053
2076
2146
2743
3186
3458
4012
4119
4229
5178
293
562
667
1244
1317
1658
1978
1999
2173
2533
2550
3860
4261
547
893
976
1159
1166
1314
1609
1773
1785
2130
2150
2646
2670
2763
2991
3027
3129
3139
3322
3653
4409
4485
4883
5293
7984
558
1079
1146
1292
1532
1563
2305
2530
2631
2810
3135
3390
3612
3675
3978
6124
841
1484
1716
1940
1949
2010
2414
3083
3376
3722
4031
4154
4405
4595
5103
5264
5986
686
1056
1196
1309
1566
1657
1711
1712
2090
2129
2138
2555
2567
3588
3927
4634
4652
5653
8494
452
835
896
1284
1330
1346
1540
1704
2295
2475
2622
2627
3094
3100
3204
3465
3649
3891
4416
4641
4704
5787
1230
1741
2511
2757
2796
3417
3925
4113
4420
4580
5238
5300
5406
5665
5757
5922
6788
6853
7577
786
1095
1157
1187
1221
1764
1791
1931
1945
1946
2876
2994
3221
3515
3526
3760
4025
4148
4440
4986
6237
399
529
860
996
1266
1792
1852
2164
2304
2989
3154
4046
4557
4697
5255
38
621
1052
1084
1305
1417
1746
1831
2002
2144
2261
2978
3070
3285
3450
3766
4201
4223
4456
5479
5669
199
1040
1150
1407
1579
1800
2007
2013
2232
2355
2447
2690
2842
2856
2954
2974
2995
3032
3363
3652
3655
3659
3755
3830
4011
4517
4642
6030
6306
1074
1296
1469
1533
1818
2246
2255
2315
2429
2505
2515
2531
2561
2625
2869
3052
3407
3431
4089
4106
4183
4249
4317
5137
5344
5396
8040
206
414
1118
1220
1350
1655
1909
2158
2193
2417
2818
3176
3193
3446
3782
3835
3936
3960
4288
4710
5311
6749
6936
7451
1138
1342
1715
1719
1790
2216
2399
2542
2574
2609
2694
2826
2831
2938
2950
2952
3086
3247
3370
3385
3775
3902
5910
6468
303
410
737
952
1117
1126
1402
1498
1573
1932
2174
2297
2374
2419
2546
2568
2753
2774
2872
2930
3183
3318
4600
4666
5330
5401
201
898
1091
1289
1298
1395
1460
1844
2221
2301
2423
3037
3112
3127
3577
3983
4110
4374
4593
4648
4743
4958
7043
7077
182
742
807
1265
1315
1884
1933
2160
2224
2402
2768
3159
3296
3589
4056
4258
5200
5628
5775
6855
7538
581
992
1175
1197
1373
1374
1455
1513
1530
1537
1623
1669
1895
2099
2323
2336
2557
2841
3451
3625
3790
3916
4327
4790
4791
4818
5097
5285
5397
5652
6418
6442
6647
7215
7558
7931
294
306
1281
1516
1542
1544
1602
1890
1923
2143
2202
2366
2496
2838
3504
3661
3676
3726
3743
3896
3897
3923
4474
4610
4672
5095
5253
5275
5600
5965
6473
6604
401
1070
1077
1083
1335
1808
2051
2179
2478
2581
2642
2695
2700
2947
3009
3025
3776
3909
4227
4636
4640
4909
5472
5906
6638
6926
7330
7898
1115
1474
1490
1521
1880
2108
2234
2556
2578
2724
2736
2800
2801
2870
3149
3217
3327
3410
3672
3705
3943
3969
4677
5974
7752
8224
8313
699
780
1169
1546
1720
1871
2145
2412
2455
2484
2725
2824
3131
3242
3342
3593
3723
3827
3905
3982
4219
4471
4478
4494
4552
4565
5144
5197
5498
5588
6177
6474
7193
7521
8277
316
377
498
1451
1960
2031
2128
2256
2299
2390
2476
2777
2998
3365
3499
3535
3578
3657
3806
3957
3995
4080
4111
4282
4464
4746
4979
5456
5707
5772
6017
6261
6955
7445
604
863
894
1039
1148
1229
1628
1885
1944
1987
1994
2135
2185
2855
2873
2904
3071
3330
3505
3767
4124
4231
4501
4503
4831
4931
4933
4963
5036
5125
5467
5995
6122
6434
6825
7081
8671
143
198
911
1372
1459
1815
2085
2092
2155
2497
2675
2937
3075
3166
3211
3576
3663
3817
4122
4146
4314
4326
4518
4618
4665
4766
4868
5119
5203
5346
5555
5948
5991
6073
6140
6823
7237
7603
8672
400
721
905
1237
1270
1678
1862
1969
2240
2338
2490
2508
3082
3241
3406
3481
3678
3783
3922
4033
4331
4475
4570
4910
4929
4981
5054
5324
5430
5459
5718
5961
6384
6412
6519
6633
6735
9303
9478
1487
1629
1722
1968
2662
2691
2715
2854
3002
3170
3200
3461
3574
3940
4088
4137
4203
4289
4613
4657
4977
5334
5629
6033
6069
6160
6866
8605
9790
619
839
1149
1225
1951
1981
2091
2307
2432
2492
2678
3079
3332
3716
3741
3765
3838
4145
4162
4216
4537
4630
4678
4726
5059
5232
5395
5403
5431
5684
5748
5875
6129
6642
7495
7768
8137
125
694
1111
1247
1355
1454
1633
1750
1887
1966
2467
2521
2597
2617
2710
2735
3218
3272
3280
3362
3503
3662
4062
4437
4643
4645
4759
4902
5142
5488
5502
5516
5620
5655
5776
5878
6364
6370
6763
6824
7129
7679
8292
9268
1176
1216
1269
1449
1510
1535
1638
1962
2153
2247
2477
2788
2928
3045
3088
3099
3122
3512
3945
4204
4806
4824
4860
4983
5038
5053
5071
5132
5267
5382
5384
5566
5949
6292
6798
7173
8197
8717
8903
8928
183
418
627
1086
1349
1390
1420
1434
1505
1549
1781
1825
1879
2188
2267
2549
2591
2594
2804
2808
2843
3036
3210
3257
3292
3405
3430
3433
3523
3545
3949
4107
4144
4413
4523
4836
4893
4930
5441
5473
5785
5830
5908
6162
7760
8153
244
289
430
597
685
752
1114
1301
1392
1442
1612
1840
1901
2044
2054
2055
2079
2364
2433
2458
2739
2798
2868
2908
3078
3264
3313
3562
3729
3924
3961
4656
4731
4758
4936
5013
5231
5268
5393
5540
5625
6142
6411
6597
6967
7762
8118
8436
8484
9053
10579
195
284
510
563
677
735
778
1393
1580
1683
1766
1925
1959
1971
2071
2139
2163
2342
2394
2548
2786
2791
2896
3022
3232
3267
3590
3600
3693
3739
3834
3976
4002
4027
4061
4164
4188
4236
4295
4391
4451
4482
4804
5129
5184
5221
5306
5333
5361
5452
5642
5702
6155
6362
6496
6574
6615
6722
6767
7035
7527
7574
7975
7986
7991
8321
9785
1098
1257
1271
1385
1531
1713
1734
2018
2217
2298
2587
3031
3044
3192
3520
3886
3893
3972
3988
4052
4241
4342
4452
4536
4879
5067
5147
5250
5295
5313
5490
6377
6482
6627
6710
6909
7202
7553
7739
7799
8114
8145
8425
257
868
927
1413
1737
1810
2003
2009
2120
2329
2396
2452
2720
2936
2976
3033
3161
3231
3243
3251
3306
3367
3463
3735
3753
4103
4152
4567
4773
4787
4815
4973
4992
5030
5037
5251
5283
5323
5596
5694
5738
5958
5964
6156
6192
6475
6843
6949
7100
7317
7388
7519
7748
8085
8131
8181
8200
9228
9352
9934
10212
607
663
846
1399
1595
1681
1726
1738
1809
1850
2104
2589
2640
2825
2834
2849
2944
3089
3146
3350
3397
3466
3524
3531
3728
3866
3872
3966
4003
4101
4332
4460
4735
5120
5183
5188
5237
5254
5259
5299
5471
5537
5547
5567
5850
5988
6021
6151
6343
6405
6544
7177
7320
7325
7569
7604
7682
7761
9619
207
768
957
997
1318
1408
1447
1721
1775
1843
1900
1926
2227
2258
2446
2547
2650
2669
2721
2760
2770
2787
2832
3014
3177
3209
3377
3437
3484
3603
3637
3643
3816
3819
3825
3928
4050
4237
4287
4421
4524
4568
4711
4794
4825
5034
5155
5252
5445
5475
5577
5708
5832
5884
5891
5900
6007
6184
6969
7038
7086
7113
7114
7194
7468
7667
7681
7702
7749
7805
7833
8456
9211
9695
10966
11118
362
555
1000
1043
1427
1437
1921
1953
2093
2371
2377
2491
2541
2633
2744
2929
2946
2999
3117
3206
3268
3290
3302
3469
3519
3613
3665
3740
4007
4024
4278
4382
4660
4673
4823
4994
5014
5058
5093
5294
5505
5526
5527
5573
5627
5672
5679
5940
6196
6446
6563
6620
6902
7246
7605
7660
7759
7858
8098
8561
8875
8906
9989
513
564
585
700
1344
1888
1910
1939
2166
2238
2469
2473
2489
2507
2524
2558
2606
2608
2618
2628
2657
2741
2747
2859
2886
2901
2961
3119
3164
3199
3229
3299
3312
3364
3403
3522
3706
3713
3736
3820
4044
4085
4109
4279
4380
4419
4444
4490
4496
4534
4546
4602
4748
4867
4881
5069
5135
5243
5614
5639
5648
5705
5712
5847
5984
6024
6203
6547
6598
6600
6708
6736
6801
6956
7033
7118
7211
7298
7369
7394
7484
7721
7841
8138
8216
8233
8400
8486
9273
10004
16134
712
716
756
1018
1152
1165
1404
1428
1489
1634
1668
1692
1837
1856
1898
2084
2106
2223
2451
2632
2771
2792
2821
2920
2966
3059
3118
3188
3219
3345
3366
3485
3552
3564
3686
3718
3737
3991
4053
4099
4220
4271
4302
4408
4507
4510
4528
4644
4706
4762
4785
4800
4801
4849
4890
4896
4919
5265
5389
5417
5442
5494
5513
5853
5890
5914
5923
5944
6022
6094
6109
6132
6141
6144
6158
6242
6248
6271
6423
6454
6456
6625
6636
7267
7274
7278
7354
7593
7631
8227
8246
8360
8952
9050
9106
9307
9796
10133
10997
557
576
858
901
1343
1529
1820
1876
1916
2014
2380
2422
2462
2465
2599
2649
2722
2738
2827
2892
3010
3050
3126
3182
3373
3529
3533
3541
3786
3844
3937
3994
4020
4070
4074
4117
4208
4264
4323
4329
4458
4625
4832
4901
4907
4937
5007
5033
5083
5207
5245
5270
5476
5901
5928
6245
6289
6435
6570
6667
6686
6706
6756
6776
6846
6921
6947
7337
7413
7470
7639
7826
7827
7974
8013
8677
9314
9769
10125
10211
184
210
368
375
697
720
764
843
943
1081
1131
1258
1261
1767
1824
1827
1984
2094
2140
2222
2251
2284
2330
2539
2577
2582
2848
2916
2953
2985
3007
3019
3304
3336
3372
3427
3434
3467
3510
3560
3565
3648
3859
3962
4037
4098
4168
4313
4356
4359
4659
4661
4764
4793
4795
4880
4886
4895
4915
4922
4984
4987
5016
5124
5193
5222
5345
5415
5695
5744
5865
5883
5904
5924
5931
5962
5966
5968
5976
6003
6019
6166
6298
6311
6316
6363
6438
6472
6571
6623
6953
7007
7150
7240
7264
7381
7454
7500
7583
7825
7842
7867
8259
8372
8476
8510
8657
8710
9787
9904
10067
10477
10492
11325
11370
12068
637
902
912
1262
1375
1565
1689
1980
2036
2103
2134
2157
2279
2287
2296
2300
2384
2525
2663
2664
3374
3422
3432
3441
3475
3572
3628
3826
3989
4028
4058
4104
4121
4156
4170
4472
4476
4586
4628
4647
4671
4763
4768
4888
4889
4914
5225
5272
5667
5713
5799
5809
5833
5930
6005
6013
6040
6079
6081
6133
6185
6270
6304
6504
6564
6739
6741
6765
6821
6950
7102
7345
7350
7625
7657
7856
8244
8312
8394
8525
8584
8688
9564
9721
9767
10056
10318
10462
10526
10587
11599
714
845
892
1485
1524
1590
1608
1673
1867
1950
1952
1963
2004
2024
2068
2137
2205
2243
2321
2340
2348
2389
2441
2445
2495
2498
2607
2639
2645
2759
2778
2815
2923
2965
2981
3066
3104
3233
3235
3314
3338
3457
3460
3501
3509
3563
3670
3682
3855
3878
3895
3930
3946
3951
3959
4063
4078
4187
4234
4246
4247
4321
4345
4350
4376
4489
4535
4560
4707
4737
4780
4859
4884
4911
4928
4968
5081
5149
5179
5211
5341
5487
5511
5591
5603
5608
5619
5747
5770
5780
5788
5793
5889
5926
5971
6016
6085
6098
6149
6169
6204
6277
6324
6652
6660
6703
6796
6818
6848
6916
6922
6929
7029
7042
7048
7205
7226
7258
7286
7287
7374
7406
7418
7528
7649
7715
7725
7897
8325
8423
8523
8656
8796
8820
9603
9673
9774
9893
9961
9990
10148
10261
10546
10695
10706
10941
11174
11349
11991
14921
84
259
404
407
409
870
936
1090
1161
1384
1578
1639
1991
2025
2171
2277
2303
2456
2528
2543
2552
2564
2586
2592
2652
2672
2754
2803
2889
3021
3181
3227
3230
3256
3420
3521
3599
3656
3666
3908
3914
4051
4059
4093
4273
4410
4415
4426
4445
4465
4473
4513
4559
4574
4585
4591
4615
4620
4667
4693
4724
4755
4786
4843
4923
5026
5088
5117
5224
5228
5273
5279
5296
5314
5319
5320
5380
5413
5416
5424
5436
5460
5550
5671
5758
5762
5804
5856
5919
5959
6009
6011
6137
6287
6293
6329
6422
6467
6635
6699
6748
6764
6794
6827
6831
6832
6854
6937
7030
7231
7248
7250
7266
7299
7328
7358
7436
7602
7691
7704
7855
7871
7930
8164
8252
8358
8418
8440
8509
8540
8646
8729
8754
8795
8848
8999
9150
9263
9449
9607
9664
9674
9964
10072
10085
10885
10916
11023
343
763
789
834
1179
1586
1778
1779
2206
2252
2365
2372
2386
2520
2562
2665
2671
2708
2772
2793
2846
3081
3132
3187
3195
3196
3237
3239
3259
3278
3321
3357
3382
3419
3455
3645
3752
3971
3973
3977
4021
4023
4064
4135
4268
4269
4383
4418
4520
4624
4650
4670
4699
4718
4723
4761
4770
4783
4796
4829
4835
4989
5101
5242
5318
5357
5404
5434
5463
5481
5528
5545
5557
5571
5640
5800
5934
5942
6174
6221
6227
6244
6397
6441
6459
6512
6594
6674
6789
6820
6864
6891
6903
6911
6957
6958
6971
7004
7036
7306
7338
7340
7344
7412
7523
7535
7587
7591
7662
7714
8075
8116
8217
8304
8349
8460
8482
8569
8691
8774
8790
8806
8980
9161
9183
9196
9238
9745
9994
10003
10366
10466
11084
11441
11594
11657
11840
13793
14177
14486
391
496
659
1029
1238
1483
1508
1753
1860
1908
1938
2072
2088
2154
2167
2168
2311
2388
2425
2457
2459
2510
2537
2637
2797
2857
2893
2956
3004
3028
3153
3156
3185
3254
3260
3261
3341
3500
3550
3583
3640
3677
3694
3695
3699
3773
3787
3798
3869
3887
3894
3929
3958
3998
4004
4010
4072
4087
4105
4125
4134
4143
4171
4173
4214
4221
4304
4307
4360
4447
4527
4547
4663
4736
4740
4821
4852
4938
4940
4978
5060
5140
5210
5216
5339
5356
5385
5390
5465
5477
5483
5538
5633
5658
5691
5732
5925
5936
6052
6063
6115
6118
6130
6241
6273
6291
6301
6320
6342
6450
6479
6530
6596
6648
6719
6753
6792
6809
6945
7006
7065
7105
7116
7136
7151
7225
7255
7257
7262
7271
7322
7419
7424
7435
7475
7478
7479
7482
7541
7572
7579
7695
7696
7734
7798
7892
7945
7982
8003
8011
8012
8071
8077
8210
8235
8322
8381
8393
8420
8463
8731
8826
9026
9060
9151
9172
9199
9285
9318
9408
9427
9491
9583
9960
10032
10110
10186
10197
10226
10306
10727
10878
11094
11236
11301
11339
11790
13773
14248
15300
238
305
703
713
717
951
1113
1327
1557
1620
1744
1836
1989
2133
2149
2220
2233
2302
2359
2376
2482
2500
2529
2588
2603
2621
2648
2677
2705
2863
2881
2891
2902
2982
3005
3018
3039
3068
3072
3076
3080
3203
3225
3228
3258
3262
3293
3300
3317
3369
3416
3486
3532
3547
3549
3582
3595
3635
3690
3703
3715
3727
3754
3763
3780
3794
3807
3846
3877
4039
4102
4114
4153
4179
4212
4243
4362
4433
4470
4514
4607
4646
4705
4732
4861
4961
4985
4998
5023
5050
5104
5113
5121
5230
5246
5260
5288
5368
5372
5409
5440
5466
5517
5563
5662
5703
5717
5733
5807
5840
5862
5882
5896
5978
5985
6031
6048
6051
6116
6135
6181
6222
6274
6297
6299
6315
6338
6341
6349
6382
6440
6449
6455
6464
6465
6557
6568
6572
6580
6613
6690
6757
6779
6840
6883
6906
6952
6973
6976
6992
7041
7074
7078
7108
7220
7311
7363
7444
7531
7537
7554
7561
7613
7764
7775
7776
7823
7868
7958
8061
8203
8324
8374
8376
8380
8388
8408
8411
8469
8698
8708
8732
8763
8832
8858
8922
9005
9113
9224
9242
9304
9394
9412
9443
9574
9622
9672
9848
9941
10029
10314
10327
10369
10382
10397
10511
10549
10668
10751
11166
11292
11297
11399
11474
12447
12501
12735
13219
13278
13574
14687
15727
16451
639
654
701
1030
1127
1471
1541
1714
1893
2033
2062
2136
2189
2226
2245
2350
2381
2431
2584
2737
2762
2823
2840
2862
2875
2877
2968
3098
3111
3125
3136
3160
3201
3269
3339
3380
3404
3424
3483
3489
3537
3638
3802
3808
3809
3822
3876
3892
3935
3939
3944
4005
4008
4009
4030
4032
4038
4240
4270
4336
4341
4368
4424
4438
4463
4492
4540
4548
4553
4579
4638
4684
4774
4812
4855
4932
4947
4956
5041
5074
5082
5111
5258
5374
5408
5449
5457
5486
5518
5522
5532
5546
5572
5615
5752
5765
5766
5806
5831
5846
5987
6004
6043
6110
6136
6147
6171
6172
6215
6224
6256
6286
6379
6413
6439
6471
6517
6524
6549
6552
6569
6673
6681
6684
6935
7000
7019
7089
7178
7190
7243
7253
7256
7282
7295
7395
7402
7458
7466
7584
7607
7619
7738
7767
7812
7828
7843
7925
7934
7970
8016
8083
8124
8125
8132
8142
8231
8298
8547
8609
8618
8824
8846
8889
8902
8929
8976
9101
9104
9108
9186
9215
9245
9278
9325
9446
9482
9697
9797
9799
9859
10048
10158
10246
10377
10405
10430
10596
10607
10667
10669
10739
10752
10775
10831
10854
10950
11027
11197
11198
11215
11440
11448
11534
11625
11727
11875
12009
12033
12111
12291
12316
12468
12718
12722
12769
12783
12931
12996
13044
13284
13533
13972
14071
14524
14635
14673
15668
16389
152
445
570
631
733
746
891
994
1096
1143
1254
1357
1406
1429
1482
1494
1552
1589
1700
1828
1865
1983
2020
2057
2231
2285
2352
2382
2410
2440
2519
2569
2593
2654
2684
2698
2802
2871
2900
2951
3163
3198
3273
3320
3396
3399
3435
3471
3476
3490
3507
3508
3542
3707
3719
3762
3777
3824
3941
3956
3974
3985
3992
4081
4083
4132
4166
4180
4186
4189
4191
4257
4263
4319
4351
4388
4480
4569
4590
4611
4709
4745
4792
4857
4878
4892
4955
5001
5042
5047
5080
5090
5133
5166
5192
5209
5241
5336
5355
5359
5386
5387
5428
5468
5480
5508
5510
5512
5515
5590
5605
5634
5661
5664
5700
5701
5720
5774
5812
5815
5829
5857
5877
5947
5951
6014
6072
6099
6145
6152
6170
6253
6278
6308
6318
6356
6366
6367
6381
6436
6500
6541
6651
6691
6696
6715
6783
6865
6869
6896
6910
6983
7039
7051
7059
7082
7097
7163
7216
7223
7236
7307
7357
7376
7393
7409
7449
7459
7469
7529
7567
7571
7576
7588
7620
7621
7703
7777
7795
7796
7822
7872
7880
7901
7946
7951
7961
8034
8042
8089
8123
8215
8232
8251
8316
8417
8428
8457
8461
8548
8588
8611
8648
8682
8761
8805
8850
8865
8870
8886
8911
8930
9056
9121
9152
9169
9175
9279
9289
9401
9426
9437
9523
9535
9541
9594
9597
9626
9719
9822
9830
9838
9911
9969
9971
9981
10077
10089
10127
10137
10157
10171
10207
10231
10242
10279
10298
10331
10385
10400
10408
10531
10651
10724
10782
10796
10799
10859
10867
10906
10980
11010
11047
11062
11182
11330
11381
11549
11583
11629
11732
11739
11814
12053
12147
12192
12203
12256
12402
12482
12629
13421
13550
13712
13747
14330
14667
14985
15314
774
793
820
900
1064
1078
1108
1204
1360
1511
1598
1611
1757
1783
1821
1826
1849
1873
1922
1955
2035
2215
2218
2257
2286
2379
2416
2634
2701
2750
2780
2817
2907
2970
3058
3067
3121
3150
3213
3279
3282
3310
3395
3429
3493
3516
3548
3551
3554
3568
3602
3629
3650
3842
3845
3884
3906
4022
4054
4095
4129
4139
4155
4178
4218
4228
4248
4259
4291
4301
4339
4358
4396
4402
4467
4504
4533
4675
4685
4714
4739
4767
4798
4799
4805
4813
4840
4905
4917
5005
5019
5024
5052
5160
5202
5208
5219
5276
5301
5322
5376
5381
5420
5443
5448
5509
5530
5541
5569
5604
5678
5721
5730
5734
5761
5777
5798
5810
5818
5838
5866
5911
5915
5937
5975
5989
5993
6053
6067
6101
6107
6148
6150
6161
6188
6190
6218
6283
6296
6325
6335
6337
6365
6380
6389
6394
6433
6437
6502
6529
6558
6614
6629
6659
6661
6672
6692
6709
6721
6727
6734
6754
6793
6797
6838
6839
6845
6863
6870
6940
6954
6961
7104
7110
7121
7122
7169
7171
7174
7197
7201
7218
7489
7520
7522
7590
7606
7628
7689
7719
7733
7772
7806
7831
7852
7877
7878
7886
7911
7978
7990
8102
8107
8121
8155
8159
8161
8270
8296
8315
8317
8333
8344
8357
8375
8382
8385
8477
8495
8503
8508
8565
8573
8592
8643
8647
8687
8696
8741
8920
8921
8940
8958
8969
8981
9014
9046
9049
9102
9144
9218
9266
9320
9409
9419
9452
9469
9483
9618
9637
9653
9685
9715
9776
9814
9843
9881
9888
9913
10014
10113
10142
10254
10255
10305
10333
10438
10439
10449
10522
10557
10580
10639
10646
10716
10730
10801
10898
10925
10936
11009
11054
11086
11125
11176
11177
11318
11355
11382
11527
11557
11613
11679
11901
11956
12066
12254
12361
12537
12573
12861
12944
12998
13327
13453
13581
13636
13821
13870
14015
14118
14356
14944
14980
15187
268
364
385
490
492
628
827
908
1044
1122
1253
1255
1554
1601
1659
1733
1754
1761
1777
1866
1896
1917
1961
2012
2081
2083
2087
2127
2184
2249
2259
2266
2268
2273
2345
2353
2370
2373
2485
2522
2579
2602
2673
2822
2837
2867
2964
2997
3035
3038
3047
3048
3053
3155
3167
3172
3222
3266
3283
3301
3326
3328
3346
3411
3412
3428
3436
3447
3468
3480
3553
3555
3567
3584
3585
3684
3785
3813
3837
3851
3873
3879
3880
3901
3926
3965
4176
4292
4322
4385
4398
4417
4449
4462
4519
4545
4551
4555
4566
4605
4616
4623
4637
4658
4662
4674
4683
4694
4712
4779
4841
4853
4967
4974
5022
5051
5064
5096
5110
5154
5161
5173
5174
5181
5235
5289
5291
5340
5343
5375
5423
5427
5432
5450
5453
5499
5536
5609
5622
5641
5674
5677
5710
5731
5749
5763
5790
5797
5802
5820
5892
5994
6037
6039
6061
6077
6080
6087
6102
6112
6138
6157
6178
6180
6259
6268
6285
6332
6392
6428
6451
6462
6488
6511
6523
6577
6599
6632
6643
6646
6671
6712
6723
6731
6761
6806
6830
6861
6924
6927
6933
6941
6999
7010
7026
7027
7057
7090
7095
7098
7115
7130
7131
7137
7207
7234
7251
7263
7293
7301
7303
7308
7348
7359
7360
7450
7455
7462
7474
7499
7507
7548
7578
7601
7616
7627
7638
7686
7754
7783
7835
7838
7857
7859
7923
7924
8001
8008
8039
8067
8080
8088
8177
8187
8311
8434
8441
8444
8458
8490
8512
8519
8521
8568
8576
8587
8593
8601
8622
8638
8659
8666
8674
8681
8736
8760
8804
8828
8835
8836
8888
8894
8935
8967
8989
8990
8991
9027
9031
9087
9111
9142
9153
9157
9158
9180
9223
9256
9269
9310
9319
9348
9410
9428
9434
9461
9502
9529
9531
9532
9554
9595
9616
9634
9669
9684
9692
9708
9710
9718
9734
9739
9789
9817
9824
9825
9834
9857
9882
9889
9923
9935
9945
9977
9986
9988
9995
10033
10074
10107
10109
10124
10160
10265
10285
10312
10329
10386
10485
10559
10577
10599
10707
10710
10713
10735
10742
10861
10926
10975
10983
11008
11046
11161
11163
11168
11220
11227
11239
11250
11296
11443
11500
11507
11541
11567
11673
11692
11799
11884
11904
12034
12078
12088
12159
12231
12260
12274
12301
12312
12469
12497
12562
12603
12617
12717
12729
12764
12812
12827
12830
12848
13251
13325
13342
13493
13551
13587
13710
13719
13889
13899
14153
14246
14367
14387
14504
14510
14725
14882
15067
15148
15237
15311
15489
15836
15859
16231
16505
16614
504
660
666
668
765
1066
1076
1102
1171
1191
1246
1339
1436
1441
1480
1486
1492
1727
1749
1841
1869
1924
1930
1947
2001
2058
2132
2182
2186
2196
2263
2264
2293
2344
2368
2398
2413
2468
2486
2506
2512
2544
2614
2661
2668
2685
2714
2742
2751
2766
2847
2861
2874
2899
2934
2942
2948
2962
3008
3011
3029
3060
3091
3120
3128
3145
3223
3226
3238
3249
3252
3287
3295
3298
3344
3379
3400
3414
3440
3459
3477
3488
3528
3558
3587
3626
3630
3636
3674
3700
3751
3764
3768
3831
3848
3865
3875
3921
3942
3947
3981
3987
3997
4001
4029
4057
4067
4069
4086
4140
4185
4217
4250
4286
4290
4293
4344
4375
4379
4387
4395
4399
4428
4431
4481
4483
4497
4538
4561
4581
4599
4614
4619
4688
4690
4692
4721
4725
4753
4756
4802
4808
4820
4844
4846
4854
4856
4863
4874
4876
4897
4906
4950
4976
4997
4999
5010
5025
5027
5040
5086
5087
5143
5151
5176
5195
5277
5286
5287
5358
5383
5391
5398
5410
5411
5425
5447
5461
5506
5554
5562
5564
5575
5576
5589
5598
5637
5682
5685
5687
5719
5769
5845
5858
5863
5864
5935
5945
5946
5950
5977
5982
6020
6035
6041
6049
6088
6117
6126
6191
6232
6233
6249
6265
6317
6328
6340
6353
6361
6368
6374
6409
6427
6431
6445
6485
6514
6520
6540
6545
6553
6555
6664
6688
6698
6781
6816
6858
6876
6898
6899
6914
6959
6962
6991
6997
7014
7015
7055
7094
7101
7125
7181
7183
7198
7209
7235
7276
7279
7285
7289
7296
7333
7343
7405
7407
7420
7428
7443
7473
7514
7549
7551
7557
7568
7592
7596
7610
7615
7622
7650
7661
7678
7765
7797
7801
7865
7866
7876
7902
7906
7918
7927
7955
7977
7981
7989
7997
8007
8009
8014
8149
8150
8163
8173
8176
8182
8196
8201
8256
8266
8275
8283
8331
8354
8367
8404
8416
8431
8435
8450
8478
8528
8557
8575
8635
8680
8721
8748
8794
8813
8853
8854
8876
8885
8918
8938
8941
8951
8957
8993
9002
9009
9019
9032
9145
9213
9214
9237
9257
9288
9313
9333
9334
9339
9372
9388
9440
9471
9475
9485
9501
9504
9509
9514
9546
9558
9559
9575
9582
9598
9623
9625
9640
9658
9751
9755
9768
9771
9773
9831
9929
9962
10009
10012
10028
10063
10082
10152
10209
10213
10222
10237
10245
10309
10310
10357
10363
10364
10406
10448
10478
10486
10550
10582
10589
10597
10600
10643
10655
10660
10703
10741
10744
10750
10776
10795
10823
10853
10871
10879
10911
10918
10927
10938
10961
10984
10986
10993
11059
11092
11108
11119
11129
11156
11342
11365
11369
11404
11555
11560
11602
11725
11734
11779
11788
11804
11864
11880
11888
11915
11928
11959
11967
11974
11978
12128
12151
12253
12271
12276
12311
12323
12327
12347
12348
12352
12399
12472
12500
12601
12672
12688
12749
12759
12825
12834
12907
12915
12971
12973
13005
13330
13417
13426
13446
13479
13579
13608
13677
13714
13772
13822
13847
13910
14014
14104
14197
14224
14250
14297
14349
14372
14389
14434
14448
14457
14507
14519
14523
14606
14825
15029
15124
15207
15395
15784
15843
16048
16119
16120
16322
16477
16966
17337
17518
17679
19881
245
387
516
549
605
688
695
814
815
946
1010
1250
1288
1291
1313
1334
1340
1356
1371
1458
1587
1599
1607
1630
1641
1695
1725
1742
1765
1797
1941
1964
2015
2052
2095
2207
2276
2312
2325
2326
2395
2479
2566
2624
2653
2702
2703
2717
2730
2790
2814
2911
2913
2919
3046
3061
3137
3152
3165
3174
3214
3234
3255
3305
3324
3358
3371
3384
3386
3408
3409
3462
3506
3511
3557
3573
3616
3664
3671
3685
3689
3691
3704
3745
3758
3795
3796
3805
3832
3836
3843
3890
3913
3952
4016
4045
4060
4084
4090
4126
4142
4151
4182
4244
4251
4285
4305
4315
4333
4335
4354
4372
4386
4397
4404
4411
4429
4432
4434
4450
4459
4477
4487
4498
4526
4549
4562
4582
4583
4592
4601
4604
4606
4664
4669
4700
4713
4842
4848
4875
4877
4900
4904
4939
4996
5020
5028
5046
5048
5072
5089
5094
5109
5122
5156
5167
5175
5177
5190
5201
5239
5240
5247
5248
5256
5262
5297
5303
5304
5315
5316
5327
5377
5378
5433
5478
5514
5529
5544
5597
5626
5651
5699
5711
5724
5743
5754
5759
5786
5811
5814
5824
5825
5827
5839
5848
5849
5872
5927
5972
5999
6006
6010
6058
6060
6089
6093
6096
6103
6119
6123
6159
6194
6197
6199
6220
6243
6255
6257
6300
6333
6352
6355
6357
6360
6373
6396
6400
6407
6457
6463
6469
6497
6506
6518
6546
6551
6560
6582
6585
6590
6602
6653
6669
6676
6724
6725
6726
6762
6813
6829
6850
6862
6872
6873
6885
6894
6913
6948
6989
6995
6998
7008
7011
7012
7022
7054
7087
7091
7092
7128
7147
7154
7157
7159
7172
7249
7318
7323
7347
7361
7403
7414
7438
7448
7453
7511
7518
7533
7540
7575
7612
7642
7643
7665
7666
7670
7673
7683
7687
7731
7751
7773
7782
7811
7817
7862
7883
7899
7905
7913
7973
7979
7993
8006
8024
8026
8030
8035
8049
8055
8056
8074
8087
8094
8100
8110
8144
8154
8194
8245
8273
8278
8301
8343
8348
8379
8383
8384
8386
8392
8399
8405
8410
8422
8424
8479
8537
8562
8604
8606
8607
8616
8619
8625
8636
8665
8675
8689
8693
8704
8712
8724
8734
8751
8755
8769
8770
8783
8810
8829
8833
8842
8856
8862
8872
8914
8945
8950
8960
8974
9023
9029
9078
9080
9088
9093
9103
9115
9131
9156
9176
9198
9200
9207
9225
9241
9264
9301
9330
9354
9357
9384
9402
9439
9476
9486
9512
9547
9567
9568
9572
9602
9612
9663
9675
9699
9707
9748
9780
9794
9801
9826
9840
9850
9851
9852
9858
9865
9895
9930
9933
9976
9983
9999
10010
10031
10038
10059
10078
10096
10144
10166
10201
10208
10230
10238
10292
10296
10299
10323
10361
10362
10393
10407
10436
10517
10541
10547
10558
10560
10564
10574
10592
10610
10625
10626
10630
10645
10661
10800
10806
10813
10850
10863
10880
10890
10895
10899
10943
10945
10959
10960
10974
10987
11000
11021
11071
11107
11130
11147
11159
11165
11172
11185
11194
11199
11231
11238
11253
11270
11275
11289
11293
11304
11313
11315
11340
11343
11471
11473
11483
11486
11487
11539
11569
11582
11591
11598
11607
11694
11699
11705
11735
11744
11745
11780
11793
11816
11871
11945
12006
12014
12049
12051
12071
12101
12127
12132
12176
12197
12226
12268
12346
12380
12420
12463
12477
12487
12515
12622
12654
12676
12678
12730
12745
12786
12792
12798
12819
12826
12832
12838
12841
12852
12859
12886
12911
12923
12961
12980
13001
13002
13004
13011
13012
13025
13057
13060
13061
13126
13131
13176
13205
13285
13324
13340
13345
13346
13355
13368
13436
13441
13444
13481
13485
13495
13548
13650
13667
13681
13746
13778
13789
13792
13798
13800
13805
13819
13846
13894
13902
13913
13952
13983
13984
13987
14004
14053
14054
14095
14123
14188
14228
14332
14352
14427
14432
14442
14456
14459
14513
14540
14541
14556
14602
14611
14648
14742
14780
14782
14881
14883
14963
14972
15156
15166
15245
15421
15460
15490
15542
15557
15590
15717
15720
15756
15921
16135
16270
16468
16514
16530
16602
16730
17164
17278
17305
17607
17654
17678
17855
18038
18447
21285
20836
325
388
556
743
1026
1062
1071
1073
1112
1151
1155
1214
1234
1312
1341
1409
1423
1631
1691
1735
1736
1743
1755
1782
1838
1863
1886
1912
1957
1982
1997
2032
2063
2078
2100
2112
2123
2159
2195
2236
2253
2254
2313
2362
2385
2393
2406
2426
2453
2518
2565
2659
2660
2674
2683
2709
2726
2781
2836
2880
2883
2887
2888
2895
2903
2905
2910
2917
2922
2939
2941
2959
2960
2971
2977
2990
3003
3085
3090
3113
3140
3191
3347
3349
3355
3389
3392
3398
3423
3425
3443
3472
3497
3518
3605
3632
3692
3710
3717
3774
3791
3800
3870
3874
3888
3900
3907
3934
3979
3980
3999
4018
4036
4048
4049
4094
4123
4127
4130
4138
4190
4196
4211
4213
4215
4232
4253
4275
4280
4296
4298
4303
4310
4311
4346
4347
4349
4390
4448
4453
4469
4484
4495
4506
4512
4515
4521
4529
4530
4578
4632
4639
4651
4655
4698
4701
4702
4715
4744
4777
4784
4789
4830
4845
4850
4851
4903
4927
4935
4954
4970
4990
5000
5004
5035
5106
5134
5153
5163
5169
5214
5226
5263
5310
5326
5421
5500
5525
5542
5548
5561
5565
5586
5606
5617
5643
5645
5654
5657
5663
5673
5698
5704
5714
5736
5742
5750
5767
5789
5817
5826
5834
5835
5855
5861
5874
5876
5879
5895
5916
5920
5939
5943
5979
6008
6029
6032
6047
6054
6064
6071
6086
6114
6120
6125
6134
6207
6216
6229
6230
6235
6240
6251
6254
6260
6262
6267
6313
6319
6351
6358
6372
6408
6414
6415
6430
6452
6458
6510
6535
6562
6566
6575
6579
6584
6587
6617
6634
6640
6641
6655
6657
6668
6683
6702
6711
6714
6717
6751
6769
6773
6775
6786
6787
6802
6803
6804
6805
6807
6841
6868
6887
6904
6928
6932
6938
6939
6951
6960
6966
6978
6986
6990
7001
7021
7028
7052
7062
7072
7075
7079
7111
7156
7161
7166
7175
7185
7200
7228
7239
7244
7254
7259
7261
7269
7270
7294
7300
7319
7327
7332
7335
7339
7346
7352
7373
7378
7399
7408
7431
7440
7441
7463
7481
7487
7493
7517
7536
7566
7573
7594
7618
7632
7654
7659
7664
7672
7684
7697
7707
7708
7724
7726
7736
7737
7753
7769
7774
7793
7824
7829
7848
7850
7863
7864
7916
7928
7937
7938
7942
7950
7962
7967
7969
7976
7980
7983
7985
7994
8017
8022
8029
8045
8051
8072
8101
8105
8109
8120
8140
8152
8168
8169
8171
8175
8195
8198
8199
8206
8218
8225
8234
8242
8243
8248
8255
8303
8309
8314
8329
8335
8336
8337
8359
8378
8390
8397
8401
8412
8421
8426
8427
8429
8430
8443
8489
8491
8493
8499
8500
8529
8542
8543
8545
8550
8572
8583
8585
8595
8627
8631
8632
8637
8640
8651
8670
8676
8706
8744
8756
8759
8787
8809
8819
8839
8851
8884
8913
8934
8949
8977
8984
8994
9001
9015
9028
9045
9058
9061
9079
9089
9109
9120
9130
9155
9174
9178
9190
9191
9194
9202
9203
9221
9246
9247
9252
9258
9267
9274
9283
9287
9290
9291
9296
9331
9346
9351
9353
9355
9358
9364
9369
9385
9387
9390
9403
9407
9442
9447
9448
9458
9463
9494
9495
9500
9505
9507
9522
9525
9538
9573
9590
9592
9599
9600
9624
9646
9648
9654
9656
9666
9678
9682
9717
9736
9738
9744
9746
9758
9761
9762
9779
9783
9793
9808
9810
9812
9813
9819
9833
9835
9839
9876
9885
9887
9921
9931
9936
9937
9939
9940
9959
9967
10019
10026
10037
10049
10064
10066
10070
10071
10081
10086
10116
10149
10165
10178
10189
10190
10192
10206
10214
10216
10224
10263
10264
10280
10284
10294
10300
10304
10311
10316
10324
10328
10332
10371
10372
10409
10410
10422
10426
10427
10443
10447
10461
10468
10469
10481
10498
10530
10537
10542
10573
10583
10590
10604
10608
10617
10619
10634
10642
10647
10659
10688
10749
10768
10783
10803
10807
10815
10842
10844
10852
10857
10858
10865
10876
10887
10998
11011
11068
11075
11089
11098
11123
11137
11140
11141
11143
11181
11196
11226
11229
11245
11248
11259
11264
11287
11311
11314
11322
11356
11377
11387
11388
11403
11405
11412
11414
11417
11426
11439
11453
11472
11476
11484
11498
11508
11523
11563
11611
11615
11627
11630
11632
11642
11646
11698
11707
11712
11729
11730
11746
11755
11773
11818
11838
11839
11846
11860
11910
11912
11918
11950
11984
11989
11992
11996
12004
12028
12050
12076
12089
12093
12106
12116
12119
12130
12131
12136
12150
12179
12188
12245
12251
12258
12307
12322
12324
12331
12341
12354
12358
12381
12384
12390
12394
12411
12412
12425
12433
12457
12464
12491
12495
12508
12511
12512
12532
12544
12545
12590
12591
12618
12640
12669
12693
12713
12741
12761
12779
12797
12811
12813
12820
12847
12855
12862
12865
12881
12920
12948
12952
12964
12972
12974
12975
12986
13047
13051
13069
13073
13123
13146
13162
13165
13167
13185
13209
13237
13254
13273
13276
13282
13322
13323
13326
13361
13362
13373
13375
13378
13393
13423
13504
13509
13518
13529
13535
13553
13555
13563
13594
13647
13655
13690
13704
13706
13707
13711
13717
13785
13791
13806
13842
13849
13855
13858
13863
13864
13890
13891
13892
13916
13943
13970
13982
14021
14027
14028
14049
14059
14067
14094
14110
14117
14127
14130
14142
14144
14169
14175
14179
14205
14216
14235
14241
14264
14288
14305
14306
14327
14344
14365
14395
14423
14445
14526
14550
14585
14622
14624
14705
14731
14745
14770
14786
14802
14807
14817
14862
14876
14933
14934
14939
14975
14981
15000
15040
15104
15122
15128
15167
15214
15231
15268
15275
15316
15331
15333
15334
15342
15372
15408
15427
15476
15478
15492
15504
15520
15562
15606
15686
15696
15704
15705
15713
15715
15744
15755
15758
15797
15829
15863
15888
15904
15909
15910
15949
15970
15979
15982
15985
16047
16138
16150
16152
16163
16304
16354
16395
16404
16423
16654
16658
16669
16901
16959
16971
17077
17166
17267
17308
17333
17365
17546
17865
17886
17971
17975
18081
18087
18250
18337
18344
18397
18399
18502
18552
18595
18696
18698
18854
18856
167
346
696
731
755
769
869
874
910
932
974
1033
1082
1156
1172
1308
1418
1439
1481
1550
1558
1561
1569
1621
1663
1670
1703
1707
1708
1823
1855
1861
1882
1891
1956
1965
1975
2026
2048
2049
2118
2131
2141
2147
2161
2180
2194
2199
2200
2228
2242
2262
2271
2274
2339
2378
2435
2439
2481
2516
2523
2545
2554
2563
2605
2619
2620
2623
2666
2696
2719
2733
2767
2782
2794
2914
2925
2926
2931
3042
3069
3095
3102
3107
3114
3124
3134
3157
3179
3202
3236
3244
3275
3281
3297
3303
3319
3337
3356
3391
3415
3418
3456
3487
3569
3571
3591
3594
3601
3621
3624
3658
3673
3696
3697
3712
3725
3733
3749
3770
3789
3811
3812
3818
3833
3850
3854
3861
3862
3867
3912
3955
3967
3984
4047
4073
4075
4076
4077
4112
4133
4150
4197
4198
4199
4200
4202
4205
4225
4242
4266
4277
4281
4297
4306
4308
4330
4361
4363
4366
4371
4373
4381
4389
4401
4403
4446
4488
4499
4509
4511
4531
4542
4550
4563
4572
4597
4608
4609
4633
4654
4668
4676
4689
4717
4729
4733
4738
4741
4747
4771
4776
4788
4809
4811
4826
4862
4864
4865
4866
4869
4882
4916
4921
4925
4934
4943
4944
4946
4953
4962
5018
5029
5049
5056
5063
5102
5127
5128
5130
5131
5139
5146
5148
5150
5182
5186
5187
5189
5199
5205
5217
5218
5220
5234
5278
5280
5282
5290
5305
5308
5321
5332
5338
5347
5360
5362
5364
5365
5379
5412
5414
5419
5435
5474
5482
5485
5491
5492
5495
5507
5520
5524
5583
5595
5599
5607
5630
5636
5638
5644
5646
5668
5670
5690
5716
5740
5751
5771
5773
5781
5821
5822
5828
5860
5868
5903
5918
5938
5953
5954
5969
6001
6015
6018
6056
6065
6076
6083
6091
6092
6127
6128
6153
6165
6175
6176
6193
6210
6211
6219
6226
6231
6236
6238
6247
6252
6258
6272
6290
6302
6326
6327
6330
6334
6344
6376
6378
6387
6393
6402
6404
6416
6420
6426
6444
6453
6466
6470
6481
6489
6492
6501
6503
6525
6554
6567
6573
6576
6578
6583
6588
6595
6601
6608
6621
6622
6624
6645
6650
6666
6679
6689
6713
6732
6737
6738
6745
6766
6770
6771
6774
6777
6810
6815
6819
6828
6833
6835
6851
6874
6881
6888
6897
6900
6901
6905
6908
6912
6917
6925
6934
6963
6965
6970
6981
6994
7018
7023
7037
7040
7058
7060
7068
7070
7080
7096
7112
7117
7120
7124
7126
7132
7144
7146
7170
7188
7192
7217
7219
7221
7232
7241
7265
7277
7280
7291
7309
7314
7324
7362
7367
7368
7370
7375
7377
7380
7398
7411
7417
7425
7430
7432
7433
7446
7460
7490
7492
7513
7515
7530
7534
7546
7550
7585
7600
7646
7648
7656
7658
7674
7685
7690
7693
7699
7705
7709
7727
7730
7746
7747
7755
7756
7757
7790
7792
7794
7803
7814
7818
7830
7845
7869
7884
7888
7893
7895
7922
7947
7987
7992
7998
8004
8031
8032
8038
8076
8081
8084
8126
8141
8146
8147
8151
8170
8209
8211
8226
8257
8279
8280
8291
8293
8294
8295
8302
8318
8341
8350
8355
8369
8391
8402
8406
8413
8432
8438
8449
8451
8452
8459
8464
8466
8467
8471
8480
8497
8511
8526
8531
8546
8558
8560
8563
8566
8582
8586
8590
8594
8596
8602
8621
8623
8629
8652
8661
8662
8663
8683
8694
8711
8715
8716
8722
8723
8743
8749
8764
8768
8771
8772
8777
8781
8797
8800
8803
8811
8825
8837
8838
8845
8849
8863
8873
8882
8883
8895
8896
8898
8912
8931
8932
8942
8954
8959
8965
8966
8970
8971
8978
8979
8996
9008
9011
9020
9021
9030
9033
9034
9035
9040
9052
9063
9065
9075
9077
9086
9098
9110
9114
9125
9129
9133
9143
9168
9170
9171
9182
9193
9204
9216
9230
9231
9235
9240
9254
9255
9265
9275
9276
9280
9284
9293
9298
9309
9321
9323
9332
9337
9349
9359
9361
9368
9370
9381
9383
9411
9421
9423
9424
9431
9441
9456
9459
9462
9464
9465
9466
9481
9490
9506
9517
9518
9521
9561
9563
9566
9577
9584
9586
9593
9596
9601
9604
9613
9614
9632
9633
9642
9650
9657
9667
9686
9700
9709
9720
9728
9740
9743
9747
9760
9778
9782
9784
9811
9816
9821
9844
9845
9861
9866
9884
9891
9899
9900
9907
9915
9920
9926
9928
9955
9958
9979
9996
10000
10017
10043
10050
10054
10060
10062
10068
10079
10084
10092
10102
10103
10126
10134
10135
10141
10143
10145
10164
10167
10174
10185
10187
10193
10215
10217
10235
10239
10240
10247
10248
10250
10259
10260
10277
10283
10290
10293
10303
10319
10336
10337
10348
10351
10352
10355
10356
10381
10404
10412
10413
10417
10423
10433
10441
10442
10444
10445
10453
10458
10473
10484
10499
10500
10504
10508
10519
10520
10533
10554
10563
10601
10603
10611
10616
10620
10624
10632
10635
10649
10650
10653
10656
10664
10666
10680
10683
10687
10689
10692
10708
10717
10721
10728
10747
10748
10764
10770
10771
10773
10785
10790
10811
10832
10838
10872
10874
10886
10894
10896
10902
10905
10922
10937
10939
10940
10944
10949
10957
10976
10985
10989
10990
11019
11020
11026
11030
11031
11052
11064
11065
11069
11076
11082
11093
11105
11111
11152
11158
11167
11169
11183
11187
11193
11203
11204
11214
11223
11233
11246
11252
11255
11257
11267
11269
11272
11276
11282
11286
11310
11312
11316
11323
11324
11328
11331
11333
11350
11364
11384
11386
11411
11425
11435
11444
11445
11447
11450
11451
11461
11463
11468
11469
11485
11490
11499
11505
11516
11517
11518
11519
11520
11522
11532
11537
11570
11576
11612
11614
11644
11662
11668
11669
11678
11682
11688
11695
11702
11703
11706
11715
11722
11731
11736
11740
11754
11758
11765
11767
11768
11784
11791
11794
11797
11802
11813
11817
11820
11828
11830
11832
11856
11857
11858
11882
11883
11891
11898
11899
11903
11913
11917
11921
11924
11935
11938
11940
11942
11951
11968
11982
11985
12025
12043
12044
12061
12079
12081
12084
12086
12097
12107
12114
12120
12122
12145
12154
12157
12178
12186
12194
12198
12204
12217
12224
12238
12246
12279
12281
12283
12284
12292
12295
12299
12304
12308
12317
12321
12325
12329
12330
12338
12342
12355
12357
12370
12395
12405
12410
12413
12415
12418
12426
12443
12454
12458
12462
12465
12485
12492
12494
12525
12531
12564
12565
12569
12571
12592
12593
12607
12609
12621
12627
12630
12634
12635
12641
12649
12651
12652
12670
12673
12687
12696
12697
12701
12704
12710
12711
12712
12726
12751
12772
12774
12775
12781
12784
12785
12788
12803
12807
12809
12818
12831
12839
12853
12871
12873
12893
12895
12902
12908
12933
12936
12942
12949
12969
12982
12990
12994
12997
13008
13049
13055
13072
13076
13078
13101
13109
13119
13140
13143
13144
13183
13184
13189
13193
13196
13201
13213
13223
13224
13227
13236
13245
13248
13253
13256
13257
13261
13262
13264
13269
13270
13274
13287
13304
13305
13311
13312
13339
13341
13347
13357
13372
13387
13394
13400
13401
13404
13414
13419
13437
13445
13450
13478
13483
13484
13498
13503
13506
13507
13508
13516
13524
13543
13544
13546
13593
13623
13624
13645
13646
13652
13668
13686
13688
13691
13696
13708
13720
13725
13726
13732
13740
13741
13742
13748
13758
13763
13767
13779
13801
13807
13809
13825
13831
13832
13833
13840
13848
13901
13906
13908
13919
13929
13941
13948
13954
13962
13967
13994
13996
14002
14003
14006
14009
14047
14058
14062
14065
14086
14096
14099
14113
14136
14148
14162
14172
14190
14199
14206
14223
14227
14238
14239
14242
14249
14257
14261
14265
14274
14277
14280
14287
14290
14298
14317
14325
14328
14335
14338
14339
14340
14357
14362
14371
14374
14378
14385
14388
14404
14415
14422
14428
14447
14449
14455
14468
14474
14478
14498
14514
14516
14531
14565
14578
14580
14587
14590
14596
14604
14641
14643
14646
14669
14681
14682
14684
14685
14702
14709
14711
14718
14722
14736
14743
14748
14762
14766
14768
14788
14820
14830
14833
14846
14850
14853
14873
14875
14877
14884
14885
14909
14916
14918
14924
14928
14959
14977
15001
15002
15030
15033
15053
15068
15086
15087
15099
15107
15138
15142
15149
15150
15164
15174
15212
15213
15217
15219
15225
15258
15260
15281
15287
15302
15313
15315
15317
15319
15361
15382
15401
15402
15415
15430
15437
15485
15494
15495
15496
15506
15508
15516
15517
15539
15544
15550
15566
15568
15570
15583
15609
15611
15642
15646
15660
15671
15674
15681
15682
15692
15734
15738
15750
15757
15768
15787
15790
15793
15801
15810
15834
15856
15879
15899
15914
15930
15941
15944
15993
15998
16006
16025
16045
16056
16063
16069
16079
16088
16100
16116
16155
16160
16178
16187
16189
16190
16191
16193
16194
16195
16197
16206
16236
16251
16284
16298
16329
16339
16356
16386
16402
16410
16433
16472
16500
16524
16539
16551
16555
16584
16596
16631
16636
16647
16708
16717
16721
16723
16728
16729
16771
16778
16780
16819
16829
16836
16846
16886
16895
16904
16943
16957
17005
17024
17037
17047
17057
17065
17072
17089
17160
17196
17220
17227
17290
17299
17334
17345
17351
17395
17416
17417
17422
17449
17498
17523
17525
17526
17601
17620
17621
17631
17648
17785
17789
17830
18006
18010
18084
18137
18162
18165
18216
18327
18330
18433
18443
18472
18578
18646
18651
18659
18749
18871
20164
19250
19023
20299
20178
19192
20341
20062
20768
19144
19031
20287
20879
19083
19530
19960
19441
19842
19194
19626
19906
19313
20397
19184
